[
{"headline": "Tesla Texas Crash: Why Autopilots Are Always To Blame", "date": "Apr 20, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/6148-607e9e4c43bb4800061b0b57", "paragraphs": ["My heart sinks when I write about AI going wrong. Behind every headline is a lost child, spouse, parent or sibling; a grieving family. I feel weighed down by their loss, but motivated strongly to help galvanise the tech industry towards solving these problems.", "Initial reports into the accident on Saturday, 17th April seem to suggest two things:", "To be clear, if the Autopilot was switched off - then it certainly can’t be to blame for this accident, but my beef is less about whether Autopilot technology has reached human driving ability levels or not - but the effect that having a system in a car called Autopilot has on the psychology of those in the vehicle (and perhaps the cause of this any many other reports of Tesla drivers moving out of the driving seat while in motion).", "Here’s where I’m going to invoke the wrath of the Musk-eteers. Before you all send me hate mail, let me just say that I’m a big fan of the man myself. When he sent the Roadster to space wearing a Stig helmet and “Don’t Panic” on the dash, I thought this was genius. Yes, it’s probably unwarranted space debris and a bit of a juvenile prank, but it captured the imagination of millions - and gave us a glimpse into the mind of an entrepeneur at the top of their game and firing on all cylinders.", "Musk himself has said that we need to be “super careful with AI” and that it is “potentially more dangerous than nukes”. He’s right, and that’s why we also need to be careful about how we market AI.", "The technology industry has a long tradition of naming things in unhelpful ways. There are two culprits:", "The first (and more mundane) is the naming convention of products in a purely descriptive sense. Steve Jobs once quipped that if Hewlett Packard were to bring Sushi to market, they would brand it as “cold dead fish”. Many products are simply labelled by the function they perform or features they offer. Unhelpful, unsexy, but the safe approach.", "The second (and more dangerous) is the naming convention of using metaphors to explain products. Data Warehousing is an old fashioned example. It speaks (somewhat) to what is going on, but is a very poor analogy as the real world warehousing is solving a very different problem (supply chain) to the digital version (archive and storage). Data Science is a more recent example. There is very little ‘real’ science going on in data science, and the level of professionalism that one sees in the scientific endeavour of companies such as Du Pont or Merck is a world removed from the hack-y, hipster horseplay that epitomises startups.", "And so, why is Autopilot always to blame? The clue is in the name. I don’t yet have my professional pilot’s licence but I know enough about the capabilities and limits of real Autopilot systems to know that we are far from the mythological utopia where human pilots can simply sit back, kick back and let the machine do all the hard work. Yes, there are situations where airplane autopilots can fully control the plane, and even land it - but the reason why it is OK to allow the term ‘autopilot’ to be used in this context is because it is a partnership between a highly experience and professional human operator and a machine. The human knows the limits of the machine, there is (certainly in a commercial plane context) redundancy in a human co-pilot, and most importantly - any transition between automatic system and manual control is measured, anticipated and seamless.", "Now contrast this with the ‘Autopilot’ system in a Tesla. The technology is breathtakingly incredible, and potentially transformative; but the problem is with the human operator who is almost always NOT a professional driver, doesn’t have redundancy (in terms of a co-driver who can take over at any point), and doesn’t offer measured, anticipated and seamless transfer of control. They therefore shouldn’t be lulled into thinking they are or have any of these things - an unprofessional driver should never be in a cockpit with an Autopilot, unless of course that Autopilot can do every thing the human can do, in all situations.", "While we’ll never know why there was no driver in the driving seat of this tragic Tesla crash, what we can be sure of is that being in a car that has an ‘Autopilot’ will create a false sense of security to the occupants and unless anticipated transfer of control can be solved is always going to cause problems in the machine to human transfer because the human will take time to dial back into the situational context.", "The solution? Call these systems what they are. Semi-Autonomous Limited Function Autonomous Modes. SALFAM might not be as sexy as Autopilot, but if Elon and others are serious about saving lives - I bet this one change would do exactly that."], "clicks": 482},
{"headline": "Tesla Faces Speed Bumps As It Takes First Steps Into India’s Nascent Electric Vehicle Market, Analysts Warn", "date": "Apr 9, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/50989-60705127aca75800065e01d1", "paragraphs": ["Tesla has ", "finally taken some concrete steps", " to enter the vast Indian market, yet the e-vehicle giant must now navigate an inefficient and corrupt political system, the nation’s lack of battery charging infrastructure and immense poverty that would make its cars affordable only to a tiny elite, analysts warn.", "Tesla chief Elon Musk has long hinted about his ambitions in India. Last October in response to a tweet asking when the company might start selling EVs in India, he said “Next year for sure. Thanks for waiting!\" But, among other issues, he was put off by the Indian government’s imposition of high duties — as much as 100% — on imported cars. Ross Gerber, CEO of investment advisor Gerber Kawasaki of Santa Monica, Calif., told ", "Forbes", " that while India has “enormous potential” its inefficient and corrupt political system makes it difficult for foreign companies to do business there. But he thinks that despite India’s many problems, Musk was likely attracted to its huge population and its growing and highly educated middle class. “India has a highly advanced tech space and a very wealthy portion of the population that could [eventually] buy EVs,” he said. “And they also have a huge need for efficient and clean energy in transportation. It just makes sense.” Colin Rusch, senior research analyst at Oppenheimer & Co., told ", "Forbes", " that India could become an important market given its scale and potential for domestic growth. “We believe that India has always been on [Tesla’s] roadmap but timing and priority has been uncertain,” he added.", "Tesla sold just under 500,000 vehicles worldwide last year, including about ", "135,400", " in India’s huge Asian rival China, according to the China Passenger Car Association. Gerber told ", "Forbes", " that in stark contrast to India, China has an electric charging infrastructure and the the government takes “a much more active role in managing the economy.” China has far more wealthy people, boasting nearly ", "700 billionaires", ", versus only 140 for India.", "Gerber also said he thinks that Tesla may actually have faced more obstacles in its home base than in foreign countries, citing that in the U.S. “we have an entire sector of our economy that would rather see EVs fail ", "because they're losing money", ". You don't deal with that in China. If the Chinese government says ‘we're going EV,’ everyone is going EV. And if you don't buy an EV, you're not driving in Beijing. Similarly, if India says they're going electric, the people will go electric.”", "Tesla has also faced some troubles in advanced western countries which have stronger compliance and transparency than India. For example, Tesla ", "just criticized Germany ", "for its bureaucratic sluggishness in approving the start of operations at its newly constructed factory near Berlin – 16 months after the company first applied for a permit. “This [delay] discourages necessary investments in clean-energy projects and infrastructure and makes it practically impossible for Germany to achieve its climate goals,” Tesla wrote to German authorities. Transport Minister Andreas Scheuer sympathized with Tesla, tweeting the country must “simplify approval procedures, reduce bureaucracy and promote innovation.”", "Gerber conceded that if Tesla eventually releases a more moderately priced car–", "which Musk has claimed they will", ", perhaps at a price of $25,000)–the company could sell more cars in India.", "How Tesla’s Eccentric Boss Became The Number Two Richest On Forbes’ 2021 Billionaires List", " (Forbes)", "Tesla Up 700% This Year–Here Are 9 More Staggering Numbers Summing Up Elon Musk’s Wild Ride To S&P 500", " (Forbes)", "Tesla Takes Over Top Spot From Toyota As World’s Most Valuable Carmaker", " (Forbes)"], "clicks": 5699},
{"headline": "WeWork To Accept Crypto—And Will Pay Its Landlords In Crypto", "date": "Apr 20, 2021,", "company": null, "blog_id": "blogAndPostId/blog/post/50808-607eda2d97a5b0000677a92b", "paragraphs": [], "clicks": 3414},
{"headline": "Bright Side Of Short Selling: GameStop, Tesla And Beyond", "date": "Mar 30, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/7545-603284ce16ab2c0006d26336", "paragraphs": ["Short sellers are often vilified in the investing world because they profit from a stock price decline. The fight between corporate insiders and short sellers is nothing new. Elon Musk's ", "fight with Tesla short sellers", " captured the headlines for a long time. Bill Ackman's billion-dollar short ", "bet against Herbalife", " is another iconic example of such a fight. In recent months, the trading frenzy at GameStop (", "GME", ") has again prompted a lot of discussions on the role of short sellers in the market. Despite the common narrative that short sellers are to blame for stock market manipulation and price decline, a healthy dose of short selling is vital for well-functioning capital markets. ", "An efficient capital market, where prices reflect accurate information about the company's fundamentals, allows CFOs to raise funds at an attractive price in the long run. Informationally efficient capital markets are also good at allocating capital to its best use: giving money to fundamentally strong firms while rationing it for the weak ones. Short sellers make an important contribution in making prices efficient, and therefore in the efficient allocation of capital across firms.", "Since the short sellers profit from a price decline, they have strong incentives to discover bad news such as corporate wrongdoing, mismanagement, and accounting fraud. For informationally efficient capital markets, the discovery of bad news is as important as the arrival of good news. The CEOs and CFOs of a firm have all the incentives to release good news. It is the short sellers, and sometimes the regulators, who are in the business of discovering bad news and making markets more efficient in the process. Improved information efficiency that comes from the discovery of bad news helps good corporations separate themselves from bad ones. In the end, such a separation allows fundamentally strong firms to raise capital at an attractive rate. ", "Months before the collapse of Lehman Brothers, short seller David Einhorn made a famous speech describing some accounting ", "discrepancies", " in Lehman’s 2008Q1 accounting statements. In September of the year, the truth came out, and Lehman's failure was for everyone to see. Early and accurate discovery of negative information can help investors, regulators, and CFOs alike. Academic research finds overwhelming evidence supporting the positive role short sellers play in ", "improving market efficiency", ". ", "There are two other benefits of short selling that go beyond the discovery of bad news. Fearing these discoveries by short sellers, firms are likely to be more careful with their disclosures and corporate decisions in the first place. With their backs against the wall, corporate managers are likely to make better decisions when faced with heavy short-selling pressures. Such a disciplining effect improves the overall quality of corporate reporting, and it can also result in better performance in the long run. Tesla’s recent performance can be partly attributed to this disciplining effect of short sellers. ", "Second, short sellers play a vital role in keeping price bubbles under control. Stock investors can be broadly classified into two groups: optimists and pessimists. Optimists, who are bullish on the firm's prospects, can easily voice their opinion by buying more shares of the company, contributing to further price rise. Pessimists, on the other hand, can only voice their opinion by selling shares. In the absence of short selling, a pessimistic investor can only voice her opinion if she already has the stock in her portfolio. Therefore, a restriction on short selling activities will significantly decrease their ability to incorporate their views in the stock price. As a result, the stock price will reflect the views of optimistic investors only, potentially creating an unsustainable price bubble.", "GameStop's share price has experienced large swings in recent months. If short sellers are unable to borrow and short the company's stock, there is a possibility that the price level only reflects the opinion of bullish investors. Therefore, the share price can be artificially inflated. Only time will tell whether the current price level is justified or not. Still, we certainly need some short sellers to ensure prices are close to the fundamental value, reflecting both optimists' and pessimists' views.", "There is always a concern that short sellers may not be investing based on fundamental information; instead, they may be trying to manipulate the stock price through their trading. Such manipulative short selling is undoubtedly harmful to the markets. We need better regulation to curb manipulative practices. But, as a whole, there is a lot to gain from short sellers in a vibrant capital market."], "clicks": 6371},
{"headline": "Tesla Has A Temperature Problem", "date": "Mar 19, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/7573-60491076686873000681ef2a", "paragraphs": ["Battery experts confirm it, and the driving public needs to understand it. ", "For starters, let me just say I love my Tesla. It’s a white on white leather interior sports car turned suburban sedan. Driving it feels like being picked up by Richard Gere on Hollywood Boulevard — except that you’re making the car payments. To put it bluntly, the Tesla Model 3 makes our family BMW feel like a tin can Chevy Chase station wagon. And sure, it’s better for the planet. ", "So it’s rather unfortunate that our winter weekend road trip turned out to be such a disaster.", "We drove from New York to Vermont, where the state slogan should be “Because you can drive here.” It’s an easy, breezy 184 mile drive via the Taconic State Parkway. It’s so easy, in fact, we didn’t think to check if our destination had a supercharger because we just assumed there would be one reasonably close by. Mistake #1. And we start off with a “full tank”—i.e. 100% charge with a 322 mile range, so we think we’re golden. Mistake #2. ", "One hundred miles into the journey, we should be at about 222 miles, but it reads 160. Where’s the missing 62 miles? I don’t know, but I’ve got a baby in the backseat who doesn’t fully appreciate the complex nuance of battery technology, or the fact that we need to charge up but there isn’t a supercharger within 40 miles of our destination. Which, by the way, is Vermont, not North Dakota.", "So we took a detour to the nearest Supercharge station in Lee, Massachusetts. Meanwhile, the temperature has dropped to minus 2 Farenheit. When it’s this cold, a snow icon appears next to your battery icon on your touchscreen display, as if you weren’t already aware of the creeping frostbite in your fingers. After a 20 minute charge session, we arrived in Manchester with 150 miles left. Seems safe, right? Wrong. Parked outside overnight in what is now negative 8 Fahrenheit, the battery lost 30 miles. Because the cold saps the battery. ", "In industry parlance, they call this “low temperature performance.”", "Why does cold weather damage performance this badly in a Tesla, the world’s electric-car leader with a market cap of more than $673 billion (more than all U.S. automakers combined)? And how can this happen in the United States, which federally funds some of the best early-stage battery research in the world? Really, how can this happen to a modern, microprocessor controlled, lithium-ion battery at all? Especially given that the entire auto industry is amid its biggest transformation in a century, investing billions in bids to overtake Tesla (NASDAQ: TSLA)?", "It all comes down to the basic function of a regular old every day battery, something we cell phone addicts take for granted. ", "“Ions are traveling inside of the battery between the positive and negative electrodes through a liquid electrolyte. As it gets colder, the liquid becomes thicker, now closer to freezing solid. So the ions move more slowly, which causes more resistance. The more the resistance goes up, the faster you lose power,” says Greg Less, Ph.D. He’s the technical director at the UM Battery Lab in Ann Arbor, Michigan. The automotive industry uses his facility to build batteries to scale and test new ideas for inclusion in electric vehicles.   ", "Modern batteries have been optimized for the least amount of resistance possible, but that obviously doesn’t help us in a polar vortex. In a car battery, you don’t want to constrict the flow of ions in any way, which means you don’t want to be driving in freezing cold weather. ", "“You have to keep the battery warm, but the battery itself is where heat comes from. You’re draining the battery to operate a heater,” adds Less. “You can definitely engineer around temperature problems, but can you do that and still have the same mileage prediction you had when you left the garage? The answer is no.”", "Think about it like regular gas mileage. Say your car sticker says you get 25 miles per gallon, but in reality, you’re getting maybe 10. Maybe you accelerate fast or let the car idle. If you follow the rules of getting the best gas mileage, the best you can get is 25 miles to the gallon, but nobody wants to hear that. It's the same with electric vehicles. They’re going to tell you what your ‘maximum range” is fully charged (322 miles in the case of my 2020 Model 3), without calculating environmental conditions. ", "For the record, Tesla released a software update slated for April 12, 2021, with this note: “Minor Cold Weather Improvements and Bug Fixes.” It offers no details about what the improvements will be, which strikes freezing New Yorkers as very Palo Alto. What we know for sure is that the words “weather,” “temperature” and “freezing” do not appear anywhere on the MODEL 3 Long Range AWD car sticker. Rather, the tiny print on the bottom right corner of the sticker reads: ", "“Actual results will vary for many reasons, including driving conditions and how you drive and maintain your vehicle.” Gee, was that written by a corporate lawyer? It might as well say: ", "We bear no responsibility for anything that happens, ever — especially not mucking up your weekend road trip to Vermont. ", "(Tesla did not respond to requests for comment). ", "By day three, with no time to snowshoe, see a moose, or make maple pancakes, I had to drive a nerve wracking 40 miles with a supposed 96 miles of charge on the car, only to arrive at the Supercharger with just 20 miles to spare. That roundtrip took three hours. After a year quarantining, do you want to give up your precious Saturday to charge a battery? I think not. Needless to say, I’ve completely sworn off maple candy, flannel pajamas, and winter weekends in electric vehicles unless and until the self-proclaimed “", "Technoking of Tesla", "” improves his batteries and there are as many Superchargers as there are gas stations in this electric land of plenty. ", "My reaction is precisely what EV car companies, and anyone who believes in our electric-powered future, want to avoid. “How do we convey this to people, and not scare them away from EVs?” asks Less. “Tempering expectations also tempers excitement about transitioning to electric transportation. It’s a fine line to walk.”", "Extreme temperatures have never been good for batteries. It’s why we don’t leave our cell phones baking in the sun. But we’re also talking about car safety. ", "“Users do have to take precautions when the weather is extremely cold. But do not consider this technology as a static tech. Lots of scientists are trying to resolve this, and it will improve,” says battery expert Shirley Meng, Professor of NanoEngineering and Materials Science at the University of California San Diego.", "Meng is a stakeholder in ", "South 8 Technologies", ",", " ", "which", " ", "has developed a “Liquefied Gas Electrolyte” chemistry for rechargeable and primary lithium batteries. The company claims the altered properties of this electrolyte enable a wider operating temperature range of -80 to +60 °C. However, creating a material solution and producing it on a mass scale are two very different challenges. “Our timeline to deliver commercial batteries is next year (2022), though I cannot give a promise when it will be widely used,” adds Meng.  ", "It’s a race to the commercial finish line, as almost every electric auto company today claims to invest in battery chemistry research and development. An of-the-moment example is electric vehicle firm Lucid Motors, which last month announced its plans to go public at a $11.75 billion valuation, via a special purpose acquisition company called a SPAC. It's the largest SPAC transaction involving an EV company.", "Lucid is partnering with a Korean company called LG Chem, which is testing new anode chemistries and architectures that might support faster charging and better temperature performance. ", "“", "There’s a lot of research going on in a higher silicone content in the anode, and all that stuff is absolutely relevant. We’ve also just kicked off our own battery research group in house, and we’re really going to push for these architectural improvements,’ says Lucid CEO Peter Rawlinson, who is a former Tesla engineering executive.", "He’ll now have to compete with ", "Tesla’s “Tabless” cell", ", which debuted in September last year. The tabless design means electrons have less distance to flow within the cell— flowing axially rather than circumferentially — thereby reducing the direct current resistance (DCR). At the time, Tesla claimed these new cells will give the company’s batteries five times more energy capacity, and enable a 16 percent range increase for its vehicles... We’re still waiting. The Tabless cell has not yet been implemented in any new models, but Tesla said it intends to incorporate them into the new Model Y in 2021.", "“We need to advance the batteries, and we need to work on efficiency. Those two things are equally important,” adds Rawlinson. “If Tesla can advance the Tabless design, and reduce the internal resistance of the cell, I think that will be a real benefit to mankind.”"], "clicks": 17192},
{"headline": "S&P 500 Posts New Record High, Tesla Skyrockets Despite Worse-Than-Feared Inflation Data And Vaccine Concerns", "date": "Apr 13, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/5015-60759e3dd9d6b100068d328c", "paragraphs": ["The S&P 500 closed at a record high Tuesday as investors largely brushed off ", "firmer-than-anticipated", " inflation data and a potential blow to the nation's inoculation efforts, focusing instead on the Wednesday start of first-quarter earnings season, which will shed light on how corporations have been faring as the economy reopens.", "\"The Johnson & Johnson vaccine news, though an obvious negative, is unlikely to permanently disrupt the present market narrative as the scarcity of blood clot incidents coupled with alternative suppliers will keep the country on track to achieve herd immunity,\" Vital Knowledge Media Founder Adam Crisafulli wrote in a Tuesday morning note. He says investors are also likely to look through the price data given that experts have been expecting higher inflation due to what's known as base effects. In other words, monthly price data will now be based on the unusually low prices at the onset of the pandemic, so inflation will grow more quickly than usual as prices revert back to pre-pandemic levels.", "Bitcoin nabbed a new price high of about $63,300 at about 8:15 a.m. Eastern Tuesday, pushing the market capitalization of the world's largest digital currency to about $1.2 trillion, surpassing the value of Brazil's entire stock market. The new high comes one day before Coinbase, the nation's largest cryptocurrency exchange, is set to debut on the Nasdaq exchange. ", "JPMorgan, Wells Fargo and Goldman Sachs are all set to report earnings Wednesday before the market opens. Citigroup, Bank of America, PepsiCo and Delta Air Lines are slated to report Thursday.", "US Calls For Halting Johnson & Johnson Covid-19 Vaccine After Rare Blood Clot Cases", " ", "(Forbes)", "Here's Why The White House Isn't Worried About Inflation", " ", "(Forbes)", "AMC Stock Plummets After Chinese Billionaire's Firm Sells $220 Million Stake", " ", "(Forbes)", "Here's The 'Early Warning Sign' Morgan Stanley Worries About As Stocks Hit Record Highs", " ", "(Forbes)"], "clicks": 15142},
{"headline": "Tesla Billionaire Elon Musk Spurs ‘Joke’ Bitcoin Rival Dogecoin Higher After Price Suddenly Doubles", "date": "Apr 14, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/5660-6076b9e63e87300006554f5c", "paragraphs": ["Dogecoin, the memecoin named by Tesla \n ", " \n  ", "TSLA", " \n ", " billionaire Elon Musk ", "as his 'fav' cryptocurrency", ", has soared over the last few days. ", "The dogecoin price has doubled so far this week, climbing to never-before-seen highs of around 10 cents and outpacing ", "bitcoin's recent blistering rally", ". ", "Musk, whose playful dogecoin-related tweets have helped ", "the \"joke\" bitcoin rival", " soar by 6,000% over the last six months, has this morning spurred dogecoin higher, ", "tweeting", " a GIF of a laughing Shiba Inu—the dog that dogecoin is based on.", "Dogecoin has climbed into the cryptocurrency top ten, as measured by CoinMarketCap, due to its 120% rally this week, giving the combined 130 billion dogecoin tokens in circulation a total value of around $12 billion. ", "In comparison, bitcoin, by far the biggest cryptocurrency by value, now boasts a market capitalization of almost $1.2 trillion following ", "its massive bull run so far this year", ". ", "\"The greatest gainer today goes to dogecoin, which has leaped approximately 30% since the morning, briefly topping 9.5 cents a coin,\" Mati Greenspan, the founder of market analysis outfit Quantum Economics, wrote in a Tuesday email note. \"It seems the memes are in total control of this market.\"", " ", "Click here to subscribe to Forbes CryptoAsset & Blockchain Advisor", "The bitcoin price, after beginning the year at just under $30,000, has soared to an all-time high of almost $65,000 per bitcoin this week as a bitcoin trading frenzy ahead of the closely-watched market debut of U.S. crypto exchange Coinbase ", "reaches fever-pitch", ". ", "\"Fear of missing out can be a very strong emotion,\" Adrian Lowcock, head of personal investing at investment platform Willis Owen, said in emailed comments. \"Cryptocurrencies and the technology behind them might offer some potential but prices are extremely volatile and fortunes can just as easily be lost as they can be made.\"", "Almost all other cryptocurrencies are rallying hard ahead of Wednesday's Coinbase IPO, with the entire crypto market reaching a combined value of $2.2 trillion this week—", "up $200 billion in just a matter of days", ". ", "Ethereum, the second-largest cryptocurrency after bitcoin, ", "has added 15% over the last week", ", while Ripple's XRP has recovered from a sell-off at the turn of the year, doubling in price and climbing to highs not seen in over three years. ", "The broad bitcoin and cryptocurrency 2021 rally has been helped by the emergence of ", "long-awaited institutional adoption", " and support from ", "high-profile investors", "—including the likes of Musk. ", "Musk, ", "well-known for his market-moving tweets", ", last week posted \"... going to moon very soon,\" shortly after the bitcoin price began climbing over the weekend, sparking speculation Musk's rocket company SpaceX could follow ", "Tesla in adding bitcoin to its balance sheet", ".", "On April 1, Musk said his private rocket company SpaceX is going to put a \"dogecoin on the literal moon\"—", "sending the price of the meme-based cryptocurrency up 35%", ".", "The dogecoin rally began in late January when stock market traders frustrated by restrictions that were placed on popular meme stocks switched to cryptocurrencies with many piling into dogecoin."], "clicks": 146103},
{"headline": "Building A Tesla-Powered Range Rover And Ultimate Overland Vehicle", "date": "Apr 2, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/6073-60661e71d2a8d700061e1f5d", "paragraphs": ["A vintage Range Rover that has its guts torn out and replaced with a Tesla \n ", " \n  ", "TSLA", " \n ", " direct drivetrain and a Toyota 4Runner kitted out to create the “ultimate overland vehicle,” are two projects opening up myriad creative opportunities for conversion teams. One is just weeks from delivery, the other, months from completion. ", "1995 Range Rover Goes Electric", "When last we caught up with the Kissimmee, Fla.-based", " ", "E.C.D. Automotive ", "design team it was in the process of installing a Tesla electric powertrain in a Land Rover Defender. The company that specializes in customizing vintage Land Rover vehicles has now completed a similar metamorphosis on a 1995 Range Rover for a Los Angeles-based client.", "The Tesla motor is packaged with a 100-kWh battery pack and can drive an estimated 220 miles on a five-hour charge, while reaching 0-60 mph in an impressive 5.2 seconds, according to the company. ", "E.C.D. Co-founder Elliot Humble told Forbes.com the motor is basically taken from a Tesla Model S. It's compact and powerful and mounts almost exactly where the Land Rover transfer case used to be making the conversion that much easier.", "A key consideration was how the Tesla motor could be integrated into the vehicle so it doesn't appear to be an add-on, or look out of place.", "“We've seen a lot of electric conversions in a lot of companies' vehicles where they tend to have electric motors in the front where the engine was,” said Humble. “They'll still have a transmission, they'll still have a transfer case, you can put the car in first gear or whatever you want and just drive. We didn't want that. We wanted it to feel like it was factory and it should be there.”", "Aside from installing the Tesla drivetrain, the E.C.D. Team updated many of the Range Rover's outdated and worn out features such as what Humble described as “cheap aftermarket lights” and an interior that was “pretty dire.”", "Specifically, the vehicle received an Alpine White exterior finish to contrast with its black grille and complementing silver metal front and rear bumpers. It all rides on 18-inch Land Rover Boost 5 Spoke wheels and Continental Cross Contact Tires. ", "Inside, the '95 Range Rover was updated with tan leather seating, a dark wood finish on the dash and custom vertical diamond stitching throughout. Technology enhancements included high performance regenerative breaking, state of the art Infinity speakers and subwoofers, Alpine Halo 9 system with Carplay, back-up cameras and Bluetooth. ", "All the features were chosen by the client, whose identity the company chose not to reveal. Where the design and build were once conducted through renderings, E.C.D. Co-founder Scott Wallace explained those processes have now been greatly expedited. ", "“Each client designs in real time on a portal on a 3D design server,” said Wallace. “We put the software on your telephone or tablet or PC. We literally design a 3D interior and 3D exterior in real time. It's fluid with the designer. They speak with the designer and can change anything. Now they can do it in real time.” ", "Thinking of having E.C.D convert a classic Land Rover? Customizations run from around $195,000 to “north of $250,000,” according to Wallace. ", "The Ultimate Overland Vehicle", "The quest to convert a 2021 Toyota 4Runner TRD Off-Road from stock to ultimate is a multi-team effort that's not expected to be complete until August. Leading the way is the ", "Overland Expo, ", "which bills itself as the “world's premier event series for do-it-yourself adventure travel enthusiasts. The event hosts hundreds of session-hours of classes for 4-wheel-drive and adventure motorcycling, inspirational programs, a film festival and hundreds of vendors of all sorts of vehicles, bikes and equipment. ", "The Overland Expo staff is partnering with Toyota Motor North America on the project. ", "“There’s no doubt an overlander could drive a Toyota 4Runner TRD Off-Road off the showroom floor and confidently complete a backcountry journey. However, modifications — like those we have planned — both personalize as well as enhance the vehicle, enabling overlanders to travel further, longer, and more comfortably,” said Lodestone Events Marketing and Communications VP Jessica Kirchner in a statement.", "The ", "list of modifications", " and gear going in the 4Runner covers almost every capability necessary to create what might be considered the “ultimate” overland vehicle. ", "Among the features:", "The finished Ultimate Overland Vehicle Build will be revealed on August 27th at Overland Expo Mountain West in Loveland, Colorado."], "clicks": 651},
{"headline": "What Tesla’s Strong Q1 Deliveries Mean For Its Stock", "date": "Apr 6, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/25-606c25e85479d4000730d913", "paragraphs": ["Tesla (NASDAQ: TSLA) ", "said that it delivered a total of 184,800 vehicles over Q1 2021.", " [", "1", "]", " This marks an increase of about 2.2% sequentially and about 109% year-over-year. The delivery numbers are strong, considering that the company had to shut down its Fremont facility for two days in February on account of some parts shortages. Moreover, the broader auto industry has had to contend with a shortage of semiconductors and Tesla’s numbers indicate that it likely isn’t being impacted. Model 3 and Model Y deliveries grew by almost 140% year-over-year to 182,780 units, driven by stronger sales in China where the company now also produces the Model Y SUV. However, Model S and X sales stood at just 2,020 units, as Tesla temporarily stopped production of both vehicles. Although the company did not provide specific reasons for this, it is currently ramping up the production of refreshed versions of both vehicles.", "So how will these results impact Tesla’s Q1 2021 results, which are likely due later this month? It’s likely that revenues and margins will trend slightly lower sequentially on account of a lower mix of luxury vehicle sales. See our analysis on ", "How Will Tesla’s Q1 2021 Deliveries Impact Earnings?", " for more details on how Tesla’s deliveries have trended and how they could impact its earnings. That said, Tesla still looks set for a robust 2021, with production scaling up at its Shanghai plant and new factories set to come online in Texas and Berlin. Pent-up demand for new versions of the Model X and S - which are now seeing some of their most substantial updates since they were first launched - is also likely to help. During its most recent earnings call, Tesla said that it expects to grow deliveries at a CAGR of 50% a year over a multi-year horizon.", "[3/26/2021] How VW’s Big EV Push Impacts Tesla ", "Volkswagen", " outlined a series of steps to accelerate its transition to electric vehicles, targeting market leadership by 2025, challenging EV bellwether ", "Tesla", ". VW Group common stock has gained almost 20% since the announcement on March 15, while Tesla stock has declined by about -10% over the same period. So what does VW’s increased EV focus mean for Tesla in the long run? Although we think Tesla will hold its own in the EV market, we think the recent moves by the likes of VW to double down on EVs could eventually make investors rethink Tesla’s lofty valuation.", "VW isn’t exactly new to EVs. The company already has EV offerings across its brands and has invested in multiple partnerships targeted at battery technology, charging, and self-driving software. However, VW hasn’t really scaled up, as its battery-electric vehicle sales stood at just 3% of its 9.3 million total vehicle deliveries last year. That said, the company now wants to make EVs its “core business,” with plans to invest in six large battery factories while doubling down on its own charging infrastructure helping to lock in supply and increase control of its technology, much like Tesla. VW has the scale to compete - it sold over 9 million cars last year compared to just about half a million for Tesla and it also has a host of premium brands including Porsche and Audi that are likely to help its EV push. Also Europe, VW’s home market, is now the largest market for EVs, with the government offering generous incentives and this could also help VW scale up sales.", "Now, we think that Tesla will also hold its own even as the competition increases, given its early mover advantage in the self-driving and software space and its strong brand image that’s associated with high-tech EVs. Tesla is currently valued at $600 billion-plus (roughly four times VW) implying that investors expect the company will essentially dominate the EV market in the years to come. Tesla’s outlook is also extremely aggressive, with the company indicating that it expects to grow deliveries at a lofty CAGR of 50% a year over a multi-year horizon. However, we think investors could re-rate Tesla’s valuation lower if VW (or other mainstream automakers) manage to deliver compelling EVs that are well-received by customers, following through on its EV growth targets. For perspective, VW trades at a little over 35x projected 2021 earnings currently, compared to Tesla which trades at over 150x and this gap could narrow if VW executes well.", "Tesla stock has declined by almost -10% over the last two weeks (10 trading days). What are the odds of the stock rising over the next month? You can test the answer and many other combinations on the ", "Trefis Machine Learning Engine to test Tesla stock chances of a rise", " after a fall. You can test the chance of recovery over different time intervals of a quarter, month, or even just one day!", "[1/26/2021] Tesla Q4 Earnings Preview", "Tesla", " is expected to publish Q4 2020 results on Wednesday, January 27. The company has already provided delivery figures for the quarter, selling a record 180,570 cars, up 29% sequentially and by over 60% year-over-year. So how will the strong vehicle sales impact quarterly earnings? We expect the company to report revenues of about $10.2 billion, roughly in line with the consensus estimates, and a jump of about 38% year-over-year. We expect Tesla’s adjusted EPS to come in at about $0.99 per share - more than double last year’s figure, driven by better-fixed cost absorption amid higher deliveries and stronger sales of regulatory credits, which we estimate are almost pure profit. However, our EPS forecasts are slightly below consensus.", "Overall, while growth is likely to remain strong, with Tesla certainly on firmer ground financially, we continue to believe that the stock is meaningfully overvalued, trading at around 360x estimated 2020 earnings and about 26x Revenues. That being said, Tesla stock has momentum on its side, and if the company is able to deliver an earnings beat, it’s likely that its stock could rally further. See our analysis ", "What To Expect From Tesla’s Q4 2020 Earnings?", " for a detailed overview of Tesla’s Revenues and its performance in recent quarters.", "[1/12/2021] Is Tesla Poised For Further Gains", "Tesla", " stock has rallied by over 11% over the last 5 trading days and by a solid 23% over the last 10 trading days, driven by strong Q4 vehicle deliveries, which helped the company largely meet its target of selling 500k cars for 2020, and also due to a change in stance by a notable long-time Tesla bear. In comparison, the broader S&P 500 returned less than 3% over the last 5 trading days. Now, is Tesla stock poised to rise further? Although we believe the company remains fundamentally overvalued, trading at about 200x consensus 2021 earnings, Tesla has momentum on its side, and there could be more room for gains in the stock. Specifically, there is a 69% chance of a rise in Tesla stock over the next month (21 trading days) based on our machine learning analysis of trends in the stock price over the last 5 years. See our analysis on ", "Tesla Stock Chances of Rise ", "for more details. Curious about the possibility of rising over the next quarter? Check out the ", "Tesla Stock AI Dashboard: Chances Of Rise And Fall", " for a variety of scenarios on how Tesla stock could move.", "[1/8/2021] Tesla Too Dependent On Elon Musk?", "Tesla", " stock has soared about 8x over the last year, with its market cap approaching $800 billion. Tesla is valued unlike any other automotive stock - at about 200x consensus 2021 earnings, vs about 20x for the broader auto industry.", " [", "2", "]", " The Tesla investment thesis hinges on a lot more than selling luxury EVs. Investors are counting on Tesla to make fully self-driving cars, launch a fleet of robo taxis, make big improvements to battery tech, and more broadly drive the decarbonization of the auto industry. This story is tied in no small measure to the business acumen and leadership of Tesla’s visionary CEO, Elon Musk. Mr. Musk has already delivered big - changing the perception around EVs with highly desirable vehicles, building factories in record time, and taking big strides in autonomous driving. (", "Just How Far Ahead Is Tesla In The Self-Driving Race?", ") But Tesla still has a lot to prove and it will probably be years before the company grows into its lofty valuation. If Mr. Musk, left the scene, for any reason, there’s no question that the story surrounding Tesla stock would change dramatically.", "The closest parallel to Tesla’s dependence on Mr. Musk would be ", "Apple", " and the late Steve Jobs. However, Apple was much larger and more mature when its visionary departed in 2011. Apple’s Revenues stood at about $110 billion in FY’11 and its business model was largely set in stone. Its computing trifecta of the iPhone, iPad, and Mac were well established in their respective categories and the services business, led by the AppStore, was building momentum. Tesla, on the other hand, is still early in the growth cycle and is barely profitable, excluding its regulatory credit sales. (related:", " How Regulatory Credits Impact Tesla’s Margins", ")", "While the fortunes of most other mega-cap companies are also tied to their founders or senior leadership to some measure, there is a fair amount of margin of safety. For example, Facebook (with a market cap of $760 billion) and Google ($1.2 trillion) have their platforms and network effects that power their ad machines. Apple ($2.2 trillion) investors value its ecosystem that locks customers in and gets them to keep spending on products and services, while Amazon ($1.6 trillion) investors are buying into a massive physical and cloud-based infrastructure that powers its e-commerce juggernaut. We think Tesla investors, on the other hand, are really paying a premium for the ongoing innovation and future potential which is heavily tied to Mr. Musk. While this risk is obviously hard to quantify, it’s worth noting for shareholders.", "Want to play the Electric Vehicle market, but think that stocks of EV brands are overvalued? Component suppliers might be a better bet. Check out our theme on ", "Electric Vehicle Component Supplier Stocks", " for more details.", "[12/21/2020]", "Tesla", " will be added to the S&P 500 index on Monday, December 21. The stock has rallied by about 70% since the announcement of the index inclusion in mid-November and is up a whopping 8x this year, with its current market cap standing at about $660 billion. The Tesla story has appeal - the company is at the forefront of two of the biggest trends in the automotive market - electric vehicles and self-driving software. Tesla has also grown despite the pandemic, driven in part by its Chinese business, and has also posted profits over the last five quarters (although a bulk of the profits still come via the sale of regulatory credits).", "However, we think the stock is significantly overvalued at current levels. Tesla trades at about 15x projected 2021 Revenue and about 175x projected earnings. There’s little precedent for this sort of valuation in the highly cyclical and capital-intensive auto industry in recent history. In fact, using the industry average P/E of about 15x", " [", "3", "]", ", Tesla would have to post over 2x the profits of the top ten automakers combined to justify its valuation. For perspective, the top ten automakers by sales posted net profits of under $20 billion over the last 12 months.", "Now with the S&P inclusion likely to bolster Tesla’s position as a blue-chip name, could it still see a correction in the near to medium term? While Tesla stock might see lower volatility post its entry into the index, considering that its shareholder base will skew towards passive investors who won’t be actively trading and potentially managed funds that are benchmarked to the S&P 500, the stock could still get a reality check for a couple of reasons. Firstly, with highly effective vaccines being rolled out things should start getting back to normal, helping the economy. Now even an indication that the U.S. Fed could revisit its stance on ultra-low interest rates could hit valuations for high-growth stocks like Tesla. There are industry-specific risks as well. Mainstream players such as GM and Volkswagen have been doubling down on EV investments. If these players deliver compelling EVs that are well-received with customers, it could change the narrative around the auto majors and potentially hurt the valuation of pure-play EV companies such as Tesla. (related: ", "How Do We Make Sense Of EV Stock Valuations?", ")", "Want to play the Electric Vehicle market, but think that stocks of EV brands are overvalued? Component suppliers might be a better bet. Check out our theme on ", "Electric Vehicle Component Supplier Stocks", " for more details.", "[11/18/2020] Tesla Will Join S&P 500, What Does This Mean For The Stock?", "On Monday, S&P Dow Jones indicated that electric vehicle bellwether ", "Tesla", " would be included in the S&P 500 index, causing the stock to rally by over 8% in Tuesday’s trading. The inclusion is likely to be effective from December 21, although it could occur in two tranches given that Tesla will be the largest company ever added to the index, and among the top 10 companies by market cap on the S&P 500. So what does this mean for Tesla stock and investors?", "Firstly, the inclusion could drive strong near-term demand for Tesla stock from not just index funds that track the S&P 500 but possibly from managed funds that are benchmarked to the S&P 500. For perspective, S&P Dow Jones estimates, based on recent market cap data, that funds will need to sell other positions to the tune of around $51 billion to buy Tesla stock.", " [", "4", "]", " Based on Tesla’s current market cap, this likely translates into roughly 11.5% of Tesla’s total shares outstanding and over 13% of Tesla’s free float (publicly held shares that can be traded without restrictions). Secondly, having a large chunk of Tesla stock held by passive index investors could eventually reduce volatility for Tesla, which has been prone to big swings in the past. That said, the index inclusion doesn’t change the fundamental picture for Tesla. The stock appears pricey in our view, trading at about 110x consensus 2021 earnings, compared to about 26x for the broader S&P 500. At these valuations, Tesla will need to execute very well - banking on new launches such as the Model Y, its international expansion, and higher software sales - to justify its stock price.", "[Updated 7/15/2020] Will Tesla Be On S&P 500? Tesla’s Software Has One Clue", " ", "As a leader in autonomous driving, we estimate that ", "Tesla", " recorded $1.4 billion in Software Revenue in 2019 via sales of its Full Self Driving software upgrades. These upgrades, which cost about $8,000 per vehicle currently, are also highly lucrative. So ", "How Do Tesla’s Software Upgrades Impact Its Margins?", " ", "We estimate that they contributed about 400 basis points (4%) to Tesla’s Automotive Gross Margins (revenues less direct costs, divided by revenues) of 21% in 2019. Excluding software sales, Tesla is unlikely to have been profitable over the last few quarters. No discussion about S&P inclusion.", "How Do Software Sales Impact Tesla’s Margins?", "Why Software Could Account For A Higher Mix of Margins Going Forward", "Electric vehicles are the future of transportation, but picking the right EV stocks can be tricky. Investing in ", "Electric Vehicle Component Supplier Stocks", " can be a good alternative to play the growth in the EV market.", "See all ", "Trefis Price Estimates", " and ", "Download ", "Trefis Data", " here", "What’s behind Trefis? See How It’s Powering New Collaboration and What-Ifs For ", "CFOs and Finance Teams", " | ", "Product, R&D, and Marketing Teams"], "clicks": 863},
{"headline": "Elon Musk’s Fortune Falls Nearly $6 Billion After Tesla Crash Leaves Two Dead", "date": "Apr 19, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/3781-607dde5bc3d6ef0006f49d11", "paragraphs": ["Billionaire Elon Musk saw his net worth fall on Monday, as shares of his electric car company dropped following reports that two people died in a fatal Tesla \n ", " \n  ", "TSLA", " \n ", " crash over the weekend.", "Shares of Tesla were down 3.8% as of 3:45 p.m. EST on Monday, shaving $5.6 billion off Musk’s fortune. He’s now worth $174.1 billion, according to ", "Forbes", " estimates. The Tesla CEO and cofounder is the third-richest person in the world—behind Amazon \n ", " \n  ", "AMZN", " \n ", " CEO Jeff Bezos, who has a net worth of $195.9 billion, and French luxury goods tycoon Bernard Arnault, who is worth $180.3 billion.", "Tesla’s stock fell on Monday amid ", "reports", " that two men died after their 2019 Tesla Model S crashed into a tree north of Houston on Saturday night. Local authorities said that they believed the vehicle was operating without anyone in the driver’s seat—with one of the men reportedly in the front passenger’s seat and the other in the back seat of the Tesla. The vehicle was traveling at high speeds along a curve before veering off the road and bursting into flames at around 11:25 p.m., police said.", "Harris County Precinct 4 Constable Mark Herman told the media in a statement that it took emergency crews about four hours to put out the Model S fire, saying that the team even contacted Tesla for help. While electric vehicles are not necessarily more dangerous than gas-powered vehicles, high-voltage lithium batteries like the ones used in Tesla can ", "reignite even after an initial fire is put out", ", according to the National Transportation Safety Board.", "The crash also raises further questions about Tesla’s Autopilot feature. Authorities were not yet certain if Autopilot was active during the crash which killed the two men, aged 59 and 69, respectively. Nonetheless, the company’s semiautomated driving system has faced mounting scrutiny following a ", "series of accidents", " involving Tesla vehicles in recent months. The National Highway Traffic Safety Administration said last month that it had launched more than two dozen investigations into crashes of Tesla vehicles, and on Monday ", "said", " that it would also be investigating the most recent crash north of Houston.", "Tesla, which does not have a media relations department, does not appear to have issued any statements in the wake of the accident. Both the company and its billionaire CEO, however, have repeatedly ", "touted the safety", " of Tesla vehicles and the Autopilot feature. Musk, who is active on Twitter with nearly 52 million followers, ", "posted", " on Saturday afternoon prior to the accident that a Tesla with Autopilot engaged is nearly ten times less likely to be involved in an accident than an average car. ", "Update 6:45 pm EST, April 19", ": Later on Monday, Musk ", "posted", " on Twitter denying that Tesla’s Autopilot feature was involved in the crash. Data logs recovered from the accident “show Autopilot was not enabled” and that the car did not purchase Full Self-Driving (FSD), the Tesla CEO said in his tweet. “Moreover, standard Autopilot would require lane lines to turn on, which this street did not have,” Musk wrote."], "clicks": 9171},
{"headline": "CarGurus Study Shows EV Consideration Soars, Tesla Dominance Challenged", "date": "Apr 14, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/6073-60771467ab0ec50006fedc0f", "paragraphs": ["Consumer interest in purchasing an electric vehicle has doubled in the past three years but Tesla's \n ", " \n  ", "TSLA", " \n ", " dominance in the segment is at risk, according to a ", "study", " released today by car buying and research site CarGurus.com. That positive sentiment towards EVs is tempered, however, by a large percentage of respondents who said certain conditions must change before they would consider the switch.", "In the February survey of 1,097 automobile owners in the U.S. 30% said they would “probably” or “definitely” own an electric vehicle in the next five years. That compares with 15% in a similar CarGurus survey taken in 2018. Looking further out, 52% said they would probably or definitely own an EV in the next ten years compared with 34% in the 2018 survey.", "Overall, 56% said they were “excited” about the development of electric vehicles.", "Intentions are one thing, sales are quite another. Not so fast.", "“The latest CarGurus Electric Vehicle Sentiment Survey shows that there is a rapid mainstreaming around the consideration for electric vehicles, and based on our data this demand should translate to vehicle sales as the infrastructure becomes more widely available,” said Madison Gross, Director of Customer Insights at CarGurus.", "There's the rub. According to the CarGurus survey, that increased consideration of electric vehicles is largely conditional.", "When asked how effective certain items would be to convince them to buy an EV, 65% selected “if there were more charging stations in my area,” followed closely by 62% citing “if it were easy to find replacement parts, including batteries.”", "Other conditions included “if long-term fuel and maintenance savings outweigh the higher initial asking price” and tax incentives/rebates (56% each), extended warranties (53%), “good expected resale value,” (51%), cleaner battery production (48%) and “if electric vehicles become more mainstream,” (46%)", "Even if they decided to take the plunge, which automaker would get their business? Tesla tops the list at 57% who said they'd be likely to consider the brand, but Toyota and Honda are close behind at 52% and 45% respectively.", "That's now. Nearly 80% (78%) of those who said they plan to own an EV in the next decade also said they're open to “several brands” of electric vehicles.", "“Even though Tesla currently holds a leadership position for reputation and purchase consideration, there is a great opportunity with electric vehicles since the majority of shoppers have not honed in on them as the only brand they would turn to for an electric vehicle,” said Gross.", "Much of that brand consideration will depend on what body styles are available. When asked what body style of fully or hybrid electric vehicle they would be likely to consider 67% chose SUV/crossover, followed by 61% favoring sedans, 27% for hatchbacks, 20% favored pickup trucks and 21% selecting other body styles including minivans.", "Looking at a few highly promoted electric vehicles recently introduced, among those who said they plan to own an EV in the next decade 40% said they are “interested” in the Chevrolet Bolt or Bolt EUV compared with 34% for the Ford Mustang Mach-E.", "In the competitive pickup truck segment, the Tesla Cybertruck has the slight edge with 40% expressing interest compared with 32% for the Ford F-150 EV and 17% for the GMC Hummer EV.", "Findings in the CarGurus survey are a bit more optimistic than those reported in February in the J.D. Power ", "U.S. Electric Vehicle Consideration Study", " where an equal number of those surveyed (59%) said they “somewhat likely” or “somewhat unlikely” to consider an electric vehicle for their next purchase.", "In that study, familiarity with battery electric vehicles appeared to help sway consideration. Among respondents who said they have owned or leased a BEV in the past, 46% said they would be “very likely” to consider another, while only 6% said they would be “very unlikely” to consider purchasing another BEV as their next vehicle.", "What both surveys reveal is as some automakers ramp up production of battery electric vehicles in a wider variety of body styles, they've clearly captured consumers' attention. But a number of conditions must change before they can turn considerations into sales...and Tesla needs to watch its back. To paraphrase the great pitcher Satchel Paige, somebody's gainin' on them."], "clicks": 1019},
{"headline": "Price, Reliability Favors 2021 Chevy Bolt EV Over Tesla Model 3", "date": "Apr 18, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/3525-60734d052ffa8a0006c63c6a", "paragraphs": ["The Chevy Bolt has a lot going for it right now: high ratings from Consumer Reports — and maybe more importantly price. ", "In the category of “Electric Vehicles” the ", "2021 Bolt gets the highest rating from Consumer Reports", " with an overall score of 78, a tie with the ", "2021 Tesla Model 3", ". ", "And the Bolt scores 5 out of 5 for predicted reliability versus 3 out of 5 for the Model 3. The Model 3 fares better in the overall Road Test score with an 82 versus the Bolt’s 76.", "Chevy Bolt: Consumer Reports ratings", "Tesla Model 3: Consumer Reports ratings", "The Bolt is downright cheap at the moment", "On balance, if you combine price with reliability, the Bolt can be a better deal than the Model 3 for consumers who aren’t dead set on getting a Tesla.", "Chevy is having a fire sale of sorts for the 2021 Bolt. My local Chevy dealer in Los Angeles is offering savings up to an advertised $12,000, which puts the Bolt way under $30,000. ", "And car shopping websites such as CarGurus ", "list new 2021 Chevy Bolts", " priced at levels I’ve never seen before for new a Bolt.", "Why is the Bolt so cheap? ", "There is a major model year update coming for 2022: the existing Bolt is getting a makeover and Chevy is introducing the all-new Bolt EUV. ", "And the MSRP on the upcoming Bolt is a lot lower, with the 2022 Bolt EV starting at $31,995. That’s roughly $5,500 off the MSRP for the current base model. And the slightly larger 2022 Chevrolet Bolt EUV, starts at $33,995.", "In a conversation I had with one of the largest Los Angeles Chevy Bolt dealers (by sales volume), they confirmed that the heavy discounting on the 2021 models is due to the arrival of the restyled 2022 Bolts due this summer. ", "The 2022 Bolts will offer features such as adaptive cruise control and GM’s Super Cruise (hands-free-driving) tech — both firsts for the Bolt. ", "Quick comparison with the Model 3: ", "——", "NOTES: ", "*MPGe: how far a car will travel on the equivalent of one gallon of gas.", "Comments can be sent via direct message to “twitter.com/mbrookec”"], "clicks": 1333},
{"headline": "Gamestop Shares Surge 10% After CEO Shakeup", "date": "Apr 19, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/5866-607d8ff87135e000063bbc5c", "paragraphs": [], "clicks": 1167},
{"headline": "Buy Tesla", "date": "Apr 5, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/25-606b37fa59119900061b3905", "paragraphs": ["The Friday S&P breakout pointed to 100 to 300 points up in the S&P.", "The index gained 50 in the first hour this morning. ", "The monthly Tesla cycle has hit a low.", "The stock has bottomed. Below, we see higher lows in price and momentum plus improving relative strength. ", "The stock retraced 38.2% of its 2019-2020 gain and has likely completed its correction.", "TSLA Monthly Cycle", "TSLA Daily Graph"], "clicks": 5841},
{"headline": "The X-Shore Electric Boat Is The Tesla Of The Sea (And Just Snagged $17M To Expand Production)", "date": "Apr 20, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/4265-607df94c47a23f000685190a", "paragraphs": ["The X-Shore Eelex 8000 electric boat can be started remotely via smartwatch. It gathers 150 data points including water quality every single second. It knows if you fall overboard and sees when you lose something, and though it cruises at 35 knots or 45 mph, it can be limited to a snail’s pace when you put it in kid mode and grudgingly let your teen take it for a spin.", "Plus, in an over-the-air software update coming soon, it’ll get auto-docking capability.", "In short, this boat isn’t just electric. It’s the Tesla of the sea, with smarts, capabilities, and a giant touchscreen to rival the smartest land-based transportation, but on the water.", "Plus, of course, with a price tag to match.", "“We’re trying to ... drive the transformation that you’ve seen in the automotive industry from combustion engine cars to electric cars,” ", "X Shore", " CEO Jenny Keisu told me recently ", "on the TechFirst podcast", ". “We’re trying to drive that in the marine segment, and we believe that in order for people to change, the product needs to be better. It needs to be a better user experience. We won’t change just because it’s more environmentally friendly.”", "While there’s no shortage of electric boat startups like Pure Watercraft and ElectraCraft as well as long-time contenders such as Duffy, X Shore is doing something a little different.", "The Eelex 800 comes with a 24-inch touchscreen display reminiscent of the massive screens Tesla founder Elon Musk puts into his cars. It has autopilot (sound familiar?) and gets over-the-air software updates. It has cameras that sense when luggage or equipment is lost overboard. And geofencing so your boat can’t go where you don’t want it to go, whether you’re onboard or not.", "In other words, this is a boat where the software matters. Where the intelligence of the platform is a critical component of the value.", "Plus, it doesn’t apologize for being electric. X Shore has a built-in 225 kW motor with a 120kWh battery that powers the boat to accelerate like a ... Tesla.", "“You basically need to decide whether to have your eyes open or closed because you can’t change that when you’re going full throttle,” says Keisu. “From a sort of fun, acceleration perspective, it’s amazing ... basically you have an amazing torque, just going full throttle.”", "Interestingly, the green doesn’t start and stop with the powertrain. The boat is made of flax, recycled bottles, cork, and reused plastic, making it a more sustainable and ecologically-friendly boat than just about any other one on the planet.", "Listen to the interview:", "As if that’s not enough, it’s also modular and adaptable.", "“We have a lot of modularity, so you can design the boat the way you like it,” Keisu says. “It comes as a just open, bare boat, and we have different modules. So you can opt for a social module, like sun beds, sofas, tables. You can also opt for diving modules, fishing modules, and you can swap. Like two people can just flip up those modules, change, and then put them back on. So you can have lots of modules if you want to, or just take them off and have lots of friends on the back.”", "There is, of course, a downside: it’s not cheap.", "The Eelex 8000 is $329,000 USD for hull and engines. That’s all-in, ready to go, cruise off into the sunset. But you can also buy additional modules for more flexibility and use cases.", "“I would call it ‘affordable premium,’ if that makes sense,” Keisu says. “It’s turn-key ready. So most of them, when you’re trying to buy a boat you’re like, ‘Oh, this sounds great. It’s kind of expensive, but that’s okay.’ And then you have to put the outboard on, you know, the drive train doesn’t come with the boat. So we have everything is included.”", "One other consolation: a conventional boat this size might cost $500-1,000 to fuel up. The X Shore boat takes $10-20 worth of electricity to power up and can do so off household current (or supercharging, if available). That’s a lot cheaper for regular use, and like most electric engines which are so much simpler than their internal combustion counterparts, maintenance is negligible.", "Fully charged, it’s ready for two hours of full-throttle fun, or 20 hours of gentle cruising, getting you 100 nautical miles (115 miles, 185 km) to wherever you want to be.", "It may not be cheap, but the Stockholm, Sweden based company is running flat-out to deliver on massive demand. So much demand that the company recently took a $17 million funding round to 10X current production capacity to 400 boats per year.", "And government regulations are helping create the market:", "“Already now in Europe, you’re seeing Amsterdam will be fully fossil-free in 2025,” Keisu says. “So already today you cannot put a combustion engine boat in Amsterdam. Norway just came out a few weeks back that the Norwegian fjords will be fully fossil-free in 2026 ... and we’re seeing that there are actually cases in the U.S. where you’ve started to do this now as well. So I think that this is a transition that will be speeding up now.”", "The electric boat industry is a few years behind the electric car space. But with intelligent, clean, efficient boats like this, there’s evidence of the same innovation happening on water. ", "Hopefully soon it will also be available at a slightly lower price point.", "Get a ", "full transcript", " of our conversation. Or ", "subscribe to TechFirst", "."], "clicks": 504},
{"headline": "Goldman Sachs Says Stock Picking Becoming Harder, But Tesla, Twitter And Etsy Have Potential. Here’s Why", "date": "Apr 19, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/5866-607dd23c9d9fd300062afe5b", "paragraphs": [], "clicks": 3883},
{"headline": "Houston Tesla Crash Underscores How Little Is Known About The Nature Of Car Battery Fires – And Why They Can Burn For Hours", "date": "Apr 19, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/50808-607d7494c3d6ef0006b73277", "paragraphs": [], "clicks": 13140},
{"headline": "GameStop, The Second Surge: Anatomy Of A ‘Gamma Swarm’", "date": "Mar 10, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/50200-60492ecc21ad4f0006d241e9", "paragraphs": ["GameStop \n ", " \n  ", "GME", " \n ", " is not following the script. Despite the confident predictions by almost all the sideline observers (including myself) that the January frenzy in GME shares would end predictably, and badly… this “Stonk” has suddenly surged a second time, embarrassing the conventional wisdom once again.  ", "When GME first erupted in January, I thought it looked like just a clever way to accelerate a conventional short squeeze. (The mechanics of a short squeeze, and the “gamma” accelerant using call options, are described in my ", "previous column", ".) On that basis, I expected that it would soon deflate and “return to normal.” The battlefield would be littered with the carcasses of small investors who bought at the top. We’d hear the distant sound of champagne popping in the proud towers of Wall Street and Chicago, and the scolds in the press would treat us to another round of lectures on thrift and the Madness of Crowds. ", "That’s not what happened. The stock did come down as low as $38, but the deflation didn’t stick. As of this moment mid-day (March 10), GME is again trading above $300 a share. [Things are moving fast. See the ", "Update", " at the end of this piece.]", "This latest surge is revealing something truly new. Another “gamma swarm” – this time in its pure form, without the added “fuel” of an over-extended short position (the shorts were substantially cleared out by the January episode). ", "In this column, I will examine this second surge in detail. It is the type-specimen of a new kind of market maneuver, which will establish this event as more than an anomaly. The “gamma swarm” phenomenon looks like something to be reckoned with, a new trading strategy that may require many other market participants – short sellers, regulators, market makers, clearinghouses, certain hedge funds, many conventional investors – to make significant accommodations.  ", "My previous analysis highlighted two components of the January eruption: a short squeeze, and a “gamma squeeze.” ", "There seems little doubt now that the top of the January surge was the result of a successful rout of several major short-sellers, who had become complacent (it would seem) with their thesis and taken on too much risk. At the beginning of the year, the short interest in GME — that is, the percentage of the company’s stock that had been sold short – was at least 68 million shares. The entire public float (that is, the shares freely trading in the market, excluding shares held by insiders) comprises 45 million shares. A short interest in excess of the float is not impossible, but it is highly unusual.", "And unstable, as events showed. Shares sold short all have to be bought back at some point (unless the company goes completely bankrupt) – so one way to view this was as an enormous reservoir of pent-up demand, a “coiled spring,” which if somehow triggered could propel the stock sharply upwards – inflicting huge losses on the short sellers.  ", "As described in the previous column, however, successful short squeezes are historically very hard to engineer, and therefore very rare. What made the January surge in GME work was the addition of an innovative new tactic.", "The mechanics of a gamma squeeze are complex (see the earlier column for details), and I doubt they are fully understood yet. Even the professionals failed in many cases to anticipate this development, which is why some of them lost a great deal of money. ", "[The term” gamma” comes from the math involved in options pricing. It is not worth a detailed gloss for this column. We’ll use the term here, undefined, as a label.]", "The basic idea can be stated in simple terms. It involves the use of options, specifically Call Options (that is, options to buy shares in the future at a defined price – called the strike price) to drive up the price of the shares. It works because when a trader ", "buys", " a call option, it creates a risk for the counterparty who ", "sold", " that option. Without further measures, if the shares rise above the strike price, the option seller will have to acquire those shares in the open market, at a loss, to fulfill the contract. ", "There are many ways to hedge this risk. The net-net of the process, though, often requires someone to buy a share of the underlying stock – the call is converted at some point into ", "a ", "covered", " call", ". ", "The other key fact is that options are much cheaper to buy than shares. In the example developed in the previous column, based on actual market pricing, a typical 2-week call option for Tesla \n ", " \n  ", "TSLA", " \n ", " cost just 2% of the price of Tesla’s shares at the time. This means that “ordinary investors” - retail traders – can more easily participate. And if they can coordinate their option buying, they gain huge leverage by ", "forcing", " the option sellers to buy shares – putting upward pressure on the stock. ", "So, essentially, in the January surge, the pre-existing short interest in GME was like dry tinder, ready to burn but hard to ignite. The gamma squeeze – using options, with their inherently enormous leverage for creating pressure on the buy-side – was like adding gasoline and tossing a match. Boom. ", "The new surge took off quite suddenly around 2:30 pm on February 24. The stock had been quiescent for the previous 2 weeks, drifting down gently. We all thought it was the calm after the storm. But then, on the 24th, the share price doubled in the final 90 minutes of trading, and then doubled again in the first half hour of the following day. The volume was absolutely extraordinary. On February 25, GME traded ", "4 times the company’s total float.", " Over three days (Feb 24-26), ", "GME traded almost 10 times its public float.", " This is ", "probably a record", " for the turnover of shares relative to the float for a substantial public company. ", "[For comparison, ", "Tesla", " — which set its own record for the ", "value", " of shares traded for a single company on a single day when it joined the S&P 500 index (Dec 18) – traded only about ", "half of its float", " in the three days surrounding that event.] ", "The short squeeze is evidently over. The short interest had declined by February – reasonably so, since the shorts were overpowered by the January surge, and had to close out their positions. ", "So the new surge looks more like a pure “gamma” event, which from an analytical standpoint is more revealing.", "The options activity is now clearly the focus of the event. In the January swarm, too, call options trading soared — this is ", "the “gamma” signature", ". ", "But most observers focused on the slaughter of the short sellers, rather than the options activity. ", "In February, however, with the shorts depleted (relatively), options volumes exploded again.", "In a little over an hour on Wednesday, February 24, the orchestrators of the gamma surge effectively gained control of the stock and started to drive it upwards. The volume of call options exponentiated — from 63 contracts at 2:25 to over 8000 contracts at 3:46 when trading was halted for the second time in 10 minutes. The pile-on continued on Thursday, as the rout was now clear. Trading was stopped four more times in the first half hour after the opening on Feb 25. As in January, the balance was skewed in favor of Call options.", "Share trading volumes followed. ", "The share price went on a rip, which must have stunned a lot of the market know-it-alls. A second surge like this is not supposed to happen. (It certainly took me aback. I thought at first that the person who gave me the news had to be joking.)  ", "The options “gasoline” stoked the fire. Trading was halted, but the run-up continued after hours and even more furiously the following morning. ", "The options volume was not a smooth flow. The “ignition” phase seems to have been between 2:30 and 3:30 pm on the 24th. Call options suddenly began crashing into the market in a series of pulses. Call option volumes reached levels nearly a hundred times larger than just two hours earlier. If we examine the crucial window, the pulses are clearly visible. ", "The share trading volumes mirrored this pattern, with a lag.  ", "If we superimpose these patterns, it becomes clear that the options trades are driving the share trades. The following chart is somewhat busy, but the message is clear: ", "the", " ", "pulses in options volume ", "precede", " the pulses in the trading", " ", "of the shares by 1-5 minutes. ", " ", "The raw correlation between the volume of options and the volume of shares in the course of the afternoon was about 68%. The correlation of volume with price was 88%. Drive the options, drive the share volume. Drive the volume, drive the price. ", "The pattern conforms to the “gamma squeeze” concept – where the surge in options is followed by a surge in share volume. ", "Correlation", ", and ", "Precedence", " of A before B, are two criteria for establishing causality. It appears that the options trades are driving the share trades. It accords with the idea that options sellers are ", "quickly", " hedging their positions by buying shares. This would certainly be prudent in a rising market, where the risk of selling a naked call option (without hedging by buying the shares) increases with the share price, as illustrated in this example based on Tesla options (from my previous column).  ", "The extremely unbalanced short position that contributed to the January eruption was ", "no longer in place in February", ".  ", " The second surge shows that a Gamma Squeeze can be effective even with a much-reduced short interest. “Gamma” looks like an independent phenomenon.", " So far the Reddit swarm seems focused on replicating the GME template, with companies that have large short positions. But this new surge suggests that other companies with different shareholding profiles could be vulnerable. Factors such as size or liquidity could be important. We probably don't know yet what the risk factors are.", " I admit that when ", "“GameStonk 1”", " erupted, I was skeptical about any larger significance. It seemed like a one-off, a special situation. ", " I have come to see that there is enormous leverage inherent in two new factors, which are interrelated: ", " This leverage has changed the game. It will be “interesting” to watch as traders probe the market with this new instrument, to find out what it can really do. I’m not sure they even know yet what power they have.", " [I have not tried to formally quantify this leverage. But consider an example – with data that is time-stamped at the close of the market on Tuesday, March 9. Imagine that a swarm of, say, 10,000 members, each invested $1,000 in GME $270 call options for Friday March 12. The March 9 cost of the option is $24. ", "If ", "all option sellers hedged, it could drive perhaps $100 million of share volume, at the then current prices. ", " ", "Would", " they hedge? GME closed March 9 at $246. It was up $118 in the previous 3 days. If it ran another $100 in the following 3 days, each option seller would lose $52 on each option. I suspect they would consider hedging.", " ", "Update", ": GME traded above $300 on Wed March 10 – spiking as high as $348. A naked March 12 call option with a strike price of $270 would have exposed the seller to ", "a loss of $56 a share.", " It is highly unlikely that the sellers of such options would have allowed themselves to be exposed to this risk. They would have covered, hedged, by purchasing shares – adding to the surge. Gamma power!]", " Leverage – in the physical world – can be used to break things, to pry them loose. Like with a crowbar. Gamma leverage is a powerful new strategy to commandeer the share price, to pry it loose from fundamental value. ", " It is part of a bigger picture, a sea-change in the character of the markets. The long-simmering processes of detaching investment decisions from traditional price and value concepts – fostered by passive index-tracking and high frequency trading, among other trends – had looked like a slow, anesthetic drift away from rational pricing. With the “Gamma swarms” the process has suddenly become violent. The “Gamestonk” rout accomplished ", "in three hours", " what it took the engineers of the legendary Volkwagen short squeeze", " three long years", " to execute. And now the swarm has shown they can do it again, even without the short squeeze. ", " Many things are swept away in this storm – rational price discovery, market efficiency, supply-demand equilibrium… We’ll have to get used to a new sort of market regime.", " Crowbars are so old-school. The “apes” (as they call themselves) have chain-saws now. Watch out."], "clicks": 270161},
{"headline": "GameStop: Were The Short Sellers Routed? Does It Matter? (Beware The ‘Gamma’)", "date": "Mar 19, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/50200-604e3db97df0670006ca8a83", "paragraphs": ["The “twin peaks” pattern in GME’s share price (", "January", " and ", "February/March", ") has shocked the markets.  ", " There is no obvious fundamental driver for a 1700% gain in the GME share price in less than a month. GME’s sales have contracted by 30% in the past two years, with losses of over $1 billion. ", "Bloomberg columnist Matt Levine", " summed up the company as “a money-losing mall retailer in a dying business during a pandemic.” Maybe the future will be brighter, or maybe not. But it is clear that right now Price and Value are out of joint. ", " Beyond that, however, the pattern make no sense technically, at least according to the standard view of how the market works and how prices move. Normally, when a stock moves up, we expect a certain steadiness. There are mechanisms – psychological, procedural – that guide-rail the process. A triggering event catches the market’s attention and prompts a reassessment. Some investors move quickly; others lag, then join in. Momentum develops, trend-followers pile on, the media talk up the story, the chat rooms get going, and investor sentiment ripens to a golden glow of positivity. The equilibrium-seeking tendencies of the market modulate price movements and smooth out the fluctuations. ", " ", "Tesla’s recent rise is a good example", ". Its shares doubled in the 4", "th", " quarter of 2020 following the announcement that the company would join the benchmark S&P 500 index. The move was powerful, but not violent.  ", " A case can be made that Tesla is overvalued. Its price-earnings ratio is well over 1000. It could reasonably be seen as a “bubble.” But the pattern is familiar. ", " The GME move is something else. The price runs right off the chart. The word “bubble” does not do justice to the violence of the GME price explosion. ", " ", " Single spikes like GME’s January surge are not unknown. They are rare, but explicable, usually as technical adjustment by investors compounded by some sort of crowded trade. But a ", "double spike", ", without fundamentals, with outlandish volume statistics (see below)… is a new chimera. And yet there it is.", " Is it a freak, an anomaly like the Flash Crash of 2010? Or is this a sign of something truly new, an important change in market behavior? Something that may become a regular part of the game going forward?  ", "Previous columns ", "[see for details]", " made the case that this event arose from a novel process called a “gamma squeeze.” A rise in demand for GME call options led the option-sellers to hedge their risk by buying GME shares, driving the price upwards. ", "[“Gamma” refers to an obscure variable used in option pricing math. It can be viewed here simply as a convenient label for this trading maneuver and does not need to be formally defined.]", " ", " In the January surge, this gamma hedging action helped squeeze unwary short sellers, who were caught out and forced to cover [i.e., buy back the shares they had sold short], adding to the “melt-up.” In the February surge, it appears that the short interest played a much smaller role. ", "Other observers", " came to the same conclusion. ", " This implies that in February the “gamma squeeze” alone was able to drive up the price. ", "If this view is correct, it has broader significance. Short squeezes are well-understood, but are hard to engineer (for reasons discussed in my previous column). A “gamma squeeze” is much easier to mobilize. Options are ", "much", " cheaper than the underlying shares. Social media can quickly enlist large numbers of retail players. If high demand for low-cost options can drive a corresponding demand for high-cost shares (for hedging by the option-sellers), this new tactic may have a much wider applicability, and could become a more common occurrence. ", " The Reddit “apes” (yes, that is what they call themselves) have focused their attention until now on stocks with a significant short interest, which was clearly the case for GME prior to the January surge. But if the February surge was effected ", "without", " the extra “fuel” of a large short interest, using the gamma mechanism alone, it may mean that this phenomenon could spread to many other companies, regardless of the short position. ", " Some readers thought I got this wrong. They questioned whether the short interest really was reduced substantially (as officially reported) between the first and the second surge. They questioned my conclusion that short squeezing played a much smaller part in the February event. ", "If there is a difference between these two events, a close examination of the two peaks may shed light on these matters.", " The data on the short interest is available only biweekly. Prior to the January surge, the short interest in GME was very large — over 100% of the public “float.” ", "[The float refers to the number of shares trading freely in the market, available to the public. It excludes shares held by insiders.]", " Following the January surge, t", "he short interest had been reduced by almost 80%.", " The straightforward interpretation is that short sellers were squeezed and most were forced to cover. ", " The short interest going into the February surge was thus much lower, and did not change much during the event. ", "If these figures are accurate, the proposition is clearly established. Short-covering played a large part in the January surge, and a much smaller part in the February surge. ", " What is most striking about this episode is not the surge in prices, but the unprecedented explosion of trading volume. ", " GME trading had averaged a few million shares a day, for many years. Then on the morning of January 13 2021, orders for 20 million shares hit the market in the first hour of trading. 93 million shares traded before lunchtime – more than twice the public float. By the closing, almost 150 million shares had changed hands. ", " It was just the beginning. Waves of buy orders began to sweep through the market over the following weeks.  ", " ", " To put this in perspective, the typical “hot stock” — like Tesla, or Apple – may trade a few percent of the float daily. On Apple’s heaviest trading day this year, shares equal to 1.7% of the float changed hands. Tesla’s trading has averaged 5% of its float daily over the last three months. Its heaviest volume occurred on Dec 18 (the day before the company joined the S&P 500). Tesla set a record for the dollar value of shares traded in the stock of a single company on a single day: 222 million shares at an average price of about $750 a share, 28% of Tesla’s public float.  ", " Since January 13, ", "GME", " has traded a daily ", "average", " of ", "118% of its float", ". On several days, the turnover has exceeded", " 300% of the float", ".  ", " During the February surge (Feb 24-26) and the January surge (Jan 22-27), the turnover ratios were 7:1 and 14:1 respectively. ", " ", "Where is this volume coming from? With the prices rising, the transaction momentum was clearly driven from the buy-side. Who was in control of the game? Who was buying? ", " Was it the short-sellers buying to cover their short positions? Certainly some of the demand, in the January episode at least, derives from this source. But the entire short interest, as overdrawn as it was, could have been taken out in a few hours once the surge began. From January 13 to the end of the month, over ", "1.2 billion GME shares traded – about ", "20 times the short interest. ", " By the time of the second surge in February, the short interest was small enough that it could have been cleared out", " ", "in the first 60 seconds of trading at the open on February 25.", " We may be justified in concluding from this that the short interest was of negligible significance for the 2", "nd", " peak. ", " This big-picture perspective on the enormous trading volumes establishes that the short interest can have played a most a minor supporting role in January, ", "de minimis", " in February.  ", " The fine structure of these two events may reveal a bit more, and confirm the big-picture conclusions. ", "[Caveat: The following discussion is rather detailed. It may not add a great deal to the understanding of these events, and may be of less interest to some readers.]", " In January, the volume shock preceded the price movement by a few days. This is unusual. The surge in volume was clearly coming from the buy-side, and should have moved the price up right away. ", " Even more surprising is that the volume dropped off sharply as the price finally jumped. This is also unusual, if not abnormal. The raw correlation between the share price and the trading volume the 10 days ", "prior", " to the week of the surge was 84%. The correlation during the week of the January surge was ", "negative 75%. ", "As the price soared, the volume fell.", " ", "There are various interpretations. But keep in mind that “volume” must include an equal number of buyers and sellers. If the price is not moving up in the face of high volume – it did not rise much until the week of January 25 – it must mean that sellers were matching buyers. Then came the market break. ", "In just 2 days (Jan 26-28), the share price ", "rose", " by a factor of 3 – while the volume ", "dropped", " by factor of 3", ". This is consistent with a scenario in which short sellers fought the buy-side volume up until Jan 26 — even as the buy-side pressure reached extraordinary levels – at which point the shorts could no longer hold on, and capitulated. They started covering — buying back the shares they had shorted. That could have allowed the “gamma buyers” applying the squeeze to step back, while the short-covering (along with the absence of new short-selling) helped propel the price upwards. (Probably some of the smart buy-side players became sellers at that point, feeding shares to the now-desperate shorts.)   ", " In February it was different.  ", "The volume and price now match up when the surge takes place, as they should in a more normal market. The raw correlation between price and volume in the two weeks prior to the surge was only 24%. But ", "the correlation during the week of the 2", "nd", " surge (Feb 22-26) was positive 95%.", " ", "The implies that", " ", "the buy-side volume drove the demand in a more conventional fashion. It is consistent with the idea that the short-sellers were now on the sidelines, largely out of the line of fire. Burned badly in January, they stayed out of the market, which allowed the buying volume (generated by the “gamma squeeze” mechanism) to move the price up unimpeded. Hence the nearly perfect correlation of price and volume. ", " The options picture supports this. In the run-up to the January explosion, average call option volume increased by 300-400% in the last two months of 2020 - with spikes as high as 1000% above “normal.” ", "Call options outnumbered Put options on every day but one", " between Nov 1 and January 22. This initiated the hedging process underlying the “gamma squeeze,” and slowly mopped up the “normal” sell-side interest. Some short sellers may have seen what was coming and exited their positions. Others may have increased their short positions to try to keep the lid on the stock.  ", " On January 22, the call options volume jumped to over ", "13 times the Nov-Dec average.", " This broke the “resistance” in the market. ", " Interestingly the put options now rose above the call options for the first time. I believe this was partly opportunistic, and partly a shift by short sellers to maintain a principled negative view (that the stock was now overvalued) while exiting the dangerous short interest in the shares. ", " I will also hypothesize that some of the call option sellers – prior to Jan 13 or Jan 22 at the latest – may not have realized what was happening, and may not have hedged – or not right away. When the stock took off, they were perhaps in the same position as the short sellers. They would have had to cover their naked calls by belatedly buying shares. Hard to verify, however. ", " The February surge looks rather different, rather more “normal.” Volumes of Puts and Calls are essentially equal, which portrays a more balanced view in the options market.  ", " The options-sellers were now hip to the gamma game. Ready to respond quickly, by placing the hedges they needed. On Feb 24", "th", " - when the surge began abruptly at about 2:36 pm in the afternoon – the hedging buys lagged the spikes in call options by just a few minutes. Here is the figure from the previous column. ", " This rendered the gamma surge more surgical and more effective, producing a quicker response in the share price. The short sellers were no longer in the middle of the gamma process, selling into the demand, as they had been doing (I believe) in January. ", " Short-selling is a technically complex topic. It encompasses a diverse set of trading and investing techniques and interests. Not all short-sellers share the same objectives, or respond in the same way to market movements. The data on short-selling is of a lower quality than many other types of market information. The applicable regulations are confused and ineffective (I speak in part from personal experience), as well as out of date (as are many regulatory policies in a fast-evolving high-tech financial system). I will address the subject in more detail in a subsequent column.", " Nevertheless, I think the available evidence does support certain conclusions. ", " Regarding the specifics of the GME event – ", " Regarding the broader significance of all this:: "], "clicks": 18466},
{"headline": "What Is The GameStop Pokémon TCG Promotional Flapple, And How Much Is It Worth?", "date": "Mar 19, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/6193-605461094756d00007974eed", "paragraphs": ["Promotional Pokémon: Trading Card Game cards seem to be all the rage at the moment. Whether it's ", "McDonalds", " or ", "General Mills", ", everywhere is seemingly wanting to throw Pokémon cards at you. Now, GameStop has joined in, and is offering an exclusive card to its customers.", "What Is The GameStop Promotional Pokémon Card?", "It's Flapple! Ostensibly the same as the Flapple card from Sword & Shield: Rebel Clash, this version has a few key differences that make it worth picking up.", "First, it has it’s a different style of foiling from the original Flapple, using the galaxy style that can be identified by the swirls and circles embedded in the foil. Secondly, it is also stamped with the GameStop logo. It's… not ", "great ", "looking, just like it's been slapped on there. But it does make it a unique card.", "How Do I Get the GameStop Flapple?", "To get Flapple, you'll need to act pretty quickly, as each GameStop store has a limited supply of them to give out. According to ", "PokeBeach", ", to qualify for the Flapple you'll need to spend at least $15 on other Pokémon TCG products. That's not too difficult, just grab a few Battle Styles or Vivid Voltage Booster Packs, or maybe a Mini Tin and you'll hit the minimum purchase. Of course, that's assuming your store even has Pokémon TCG stock at the moment.", "Will The GameStop Flapple Be Worth Anything?", "Much like the McDonalds and General Mills promotions, probably not. Unless they're incredibly old and have nostalgia to bank on, or are a unique, one-of-a-kind item, promo cards just don't sell for as much as what people think they do. ", "Plus, this isn't a brand new card, it's a slightly modified reprint of one from a recent set. Any value this has will be purely based on the foiling and the stamp. If you're wanting to be optimistic, ", "maybe ", "it'll get a little bit of extra value for being a GameStop-branded product released around the same time as the WallStreetBets/'Gamestonks' situation. But I severely doubt that.", "Flapple is an adorable Pokémon, and the galaxy foil on this version looks great. If you're wanting it for your collection, you'll need to act quickly while supplies last, but don't go into this thinking it'll be an 'investment' in the same way the ", "most valuable Pokémon cards", " are.", "—", "The Flapple GameStop Promotion starts today (Friday, March 19 2021) and lasts while stock is available at participating GameStop stores. Please either phone your local store to check before purchasing, or follow all social distancing and mask requirements when looking for your sweet apple friend."], "clicks": 9179},
{"headline": "GameStop’s Day Of Reckoning May Have Arrived", "date": "Mar 24, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/2464-605ad77137856700061fdd30", "paragraphs": ["GameStop announced its ", "January fiscal fourth quarter results", " after the market closed on Tuesday and results were a bit light. Revenue of $2.12 billion were short of the expected $2.21 billion and EPS, which was expected to be $1.35 on an adjusted basis, came in at a reported $1.27 but were helped by $1.03 in tax benefits. While it is only a small miss if the analyst were incorporating the tax help, it would be a huge miss if they were not.", "Global E-commerce sales increased 175% in the quarter and 191% for fiscal 2020 but these results were expected since the ", "company announced its holiday sales", ".", "While not giving guidance is not a surprise, doing away with same store sales is to a degree understandable but it is a disappointment. Not answering questions and ", "filing in its 10-K", " that it may sell additional shares crushed the stock in the after-market.", "The stock has fallen the past four days from $209.81 to $181.75 and is down over $27 in the after-market to $154. ", "Balance sheet and cash flow were solid", "GameStop’s balance sheet and cash flow were solid for the year given everything it had to navigate. While non-restricted cash was essentially flat over 12 months debt fell by about $80 million (and restricted cash increased by $110 million).", "Operating cash flow turned positive to $124 million, but this was due to the company significantly decreasing accounts payables and accrued liabilities. And free cash flow was positive coming in at $64 million but it may be hard to replicate this going forward. This may be one of the reasons management and the Board are considering selling shares.", "Will a different game plan be enough", "George Sherman, GameStop’s CEO, said, “we are excited by the opportunities that are in front of us as we begin prioritizing long-term digital and E-Commerce initiatives while continuing to execute on our core business during this emerging console cycle. Our emphasis in 2021 will be on improving our E-Commerce and customer experience, increasing our speed of delivery, providing superior customer service and expanding our catalogue.”", "GameStop is making very good progress with its E-Commerce initiatives as seen with the huge increase in sales the past quarter and year. The challenge is to keep up such a steep ramp since it comprised 34% of net sales in the quarter vs. 12% a year ago. There will be some very tough comps later in 2021.", "Revenues should turn back to some amount of growth, but given the shares rich valuation due to the Reddit crowd helping to goose the stock up it may not be enough to satisfy investors.", "The fundamental numbers still don’t make sense", "Before Covid-19 derailed the U.S. and worldwide economies GameStop was slowly losing revenue from fiscal 2016 to 2018 then had a sharp drop-off in fiscal 2019 (ended in January 2020). GameStop may be able to shake up its business enough to recover at least some of downturn but it won’t happen overnight.", "Note that while GameStop’s fiscal year ended on January 30, 2021, and would normally be labeled fiscal 2021, GameStop calls it fiscal 2020.", "When calculating the company’s valuation metrics these results use fiscal 2018’s $8.3 billion in revenue so as to be as generous as possible.", "Short squeeze is a minor, if any, player recently", "While the Reddit crowd helped to create a short squeeze on the shares in late January leading the stock to reach $483 intra-day and close at an all-time high of $347.51, the recent increase to March 10’s close of $265 is probably not due to short positions having to be covered. Note that the stock has traded down 7 of the past 9 sessions and is poised to be down again today.", "Ihor Dusaniwsky, Managing Director at Predictive Analytics, estimates how much short interest there is in a stock on a daily basis. His analysis shows that the first big run-up in the shares in late January/early February essentially forced the shorts to cover and dramatically reduce their positions. ", "At the beginning of the year the stock was under $19 (right axis/green line in the chart below) and Dusaniwsky estimates that there were over 70 million shares shorted (left axis/orange line in the chart below). Since there were 69.7 million shares outstanding as of December 1 last year there was a power keg ready to blow on the stock.", "In late February his analysis shows that there were about 15 million shares shorted before the stock started its recent rise. With almost 24 million or more shares traded every day from February 24, the start of the recent run, to March 16 it doesn’t appear that short covering has been a major driver.", "Note that the analysis is of last Wednesday, March 17."], "clicks": 1337},
{"headline": "After Premarket Drop Traders Still Bullish On GameStop Despite Plan For $1 Billion In New Stock", "date": "Apr 5, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/51061-606b395d59119900061bccb9", "paragraphs": ["GameStop \n ", " \n  ", "GME", " \n ", " was at the center of an unprecedented week on Wall Street in late January, as a meme-fueled short squeeze turned Redditors into millionaires and wreaked havoc at hedge funds such as Melvin Capital Management. ", "Now, after two months of watching and waiting, the video game retailer is at last trying to cash in on the craze. ", "GameStop announced plans Monday to raise as much as $1 billion by selling as many as 3.5 million shares of its common stock, capitalizing on a share price that has remained at surprisingly lofty levels after the height of the January craze. GameStop said it could use proceeds from the stock sale to fund its ongoing digital-first transformation, to add new products and to pay down debt. ", "Investors expressed initial skepticism, as GameStop shares were down some 16% in pre-market trading. But more bullish sentiment quickly returned. GameStop’s stock was back up above $190 per share by late morning, marking a decline of less than 1% from last Friday’s close. That’s a far cry from the $483-per-share peak GameStop reached on Jan. 28, but overall, the company’s shares are still up well over 800% since the start of 2021. ", "The upshot of the offering is that GameStop can now convert some of its red-hot stock into cash that will be easier to deploy in the company’s ongoing bid to transform itself from a brick-and-mortar relic of a bygone era into an e-commerce power.", "Such a move was already on GameStop’s radar before it turned into a Reddit sensation: In December, the company filed a prospectus indicating plans to raise up to $100 million in a stock offering. But the calculus shifted once GameStop’s shares went bananas. In the immediate aftermath of GameStop’s initial surge, a sale of shares might have been seen by outside investors as a lack of confidence in the stock, which could have caused the price to plunge. On the other hand, if GameStop’s share price continued to soar, the company could have ended up leaving major money on the table. ", "But initially, at least, GameStop’s patience seems to be paying off. At their current price, a sale of 3.5 million shares would raise some $665 million in capital. While announcing the move, though, GameStop made sure to highlight that participating in the offering could still be a highly risky move for investors. ", "“Our common stock has recently experienced extreme volatility in price and trading volume,” the prospectus notes. “Investors that purchase shares of our common stock in this offering may lose a significant portion of their investments if the price of our common stock subsequently declines.” ", "Probably the largest reason day-traders have flocked to GameStop’s banner in recent months is the huge short position built up in the company by several hedge funds and other Wall Street investors, creating the possibility for a highly profitable squeeze. But another factor has been the real steps the company has taken in the past year to transform its business—chief among them the addition of board member Ryan Cohen, who is best known for turning Chewy into an e-commerce behemoth in the pet care space. ", "Cohen founded Chewy in 2011 and sold it to PetSmart six years later for $3.35 billion. That stratospheric growth curve has continued. Chewy was valued at $8.7 billion when it went public in 2019, and today it carries a market cap of more than $30 billion. The theory among GameStop true believers is that Cohen can now do for video games what he already did for pet food. ", "Cohen acquired a 10% stake in GameStop last September, increased that stake to 12.9% in December, and then took a seat on the company’s board in January, a few weeks before its shares began to skyrocket. Other, more recent personnel moves have given other hints of the company’s ongoing shift. Out are former chief financial officer Jim Bell and chief customer officer Frank Hamlin. In is new chief growth officer Elliott Wilke, a former Amazon \n ", " \n  ", "AMZN", " \n ", " executive. ", "In the biggest bright spot of the earnings report from GameStop’s most recent fiscal quarter, the company’s e-commerce sales were up 175% year-over year, accounting for more than a third of its total revenue. ", "The pandemic has created other tailwinds for GameStop’s transformation, namely the growing embrace of all things e-commerce and a boom of interest and consumer spending in the video game space. Earnings across the video game sector grew 12% year-over-year in 2020, according to market researcher SuperData. And gaming companies such as Roblox, Unity Technologies \n ", " \n  ", "UTX", " \n ", " and Epic Games all have seen huge investor interest and soaring valuations in recent months. ", "The iron is hot. And after two months of waiting, GameStop has decided to strike."], "clicks": 2603},
{"headline": "Tesla, Bitcoin, GameStop Bubbles All Have Roots In Tokyo", "date": "Mar 24, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/6792-605af7c06f829f0006e729a4", "paragraphs": ["Tesla. Bitcoin. GameStop. U.S. Treasury bonds. Everywhere investors look these days, they find history-making bubbles staring back at them.", "The commonly cited culprit is central banks refilling the proverbial punchbowls too often and too liberally. Too much ", "monetary liquidity", " chasing too few good bets is always and everywhere a recipe for runaway froth.", "This is the ", "why", " concerning this bubble in bubbles. More attention, though, should be on ", "how ", "we got here. And that means Tokyo.", "Yes, the Federal Reserve is the globe’s premier bubble blower as 2021 heats up. Excessive credit from the central bank of the biggest economy that prints the reserve currency will always carry the most weight with markets, and for valid reasons.", "Last week, though, Fed Chairman Jerome Powell admitted what so many economists assured us could never happen: It’s trapped at zero interest rate indefinitely with the Bank of Japan. Powell did his best not to say that, exactly. But he knows better than anyone that when the Fed says it’ll be at zero ", "until 2023", ", he might as well admit it could be 2033—or well beyond.", "Former BOJ Governor Toshihiko Fukui understands how Japan—and now the U.S.—got here better than just about anyone. ", "Fukui’s 2003-2008 tenure saw the BOJ try its hand at rate normalization. When Fukui grabbed the reins from predecessor Masaru Hayami, the BOJ was four years into its experiment with zero rates and two years into its quantitative easing era. First, Fukui ended QE. By 2006, the Fukui’s team pulled off the first of two 25 basis-point rate hikes. ", "The empire was quick to strike back. Immediately, lawmakers, CEOs, bankers and investors blamed Fukui’s brake-tapping moves for soft demand across the economy. By 2008, the first move by Fukui’s successor, Masaaki Shirakawa, was to cut rates back to zero.", "The official excuse was fallout from the “Lehman shock,” but really it was Japan Inc.’s addiction to free money. Without realizing it, the corporate and political establishments got so used to zero rates. It became a necessary ingredient for success. As borrowing costs disappeared, crushing public and corporate debts appeared less burdensome. Banks grew to enjoy cheap credit and the effect zero-to-negative yields had on balance sheets.", "Ultraloose BOJ policies, meantime, took the onus off elected officials to implement destabilizing reforms. They made it easier for exporters to avoid difficult restructuring decisions. They papered over cracks across all sectors. That fueled any number of asset bubbles—not least of which a Nikkei 225 Average near ", "30-year highs", " even as Covid-19 devastates the real economy.", "Janet Yellen has her own version of this story. Back in late 2015, long before Yellen was named Treasury secretary, Yellen was running the Fed when its ", "raised rates", " for the first time since 2006. The derision that step generated wasn’t all that different from what Fukui experienced years earlier.", "The Yellen Fed received rhetorical attacks from future President Donald Trump. In February 2018, a year into the Trump regime, Yellen was replaced by Powell. He moved quickly to slash rates back to zero and revive the QE policies Yellen had dismantled. Powell, though, pushed Fed policies into new uncharted territories, propelling Wall Street toward record highs. ", "Since Covid-19, Powell shifted the Fed into gears higher than monetary economists thought were possible. By ", "May 2020", ", the Fed’s balance sheet swelled to ", "$5.3 trillion", ", roughly equivalent to the BOJ’s.", " The trillions of dollars of asset purchases added even greater fuel to rallies in stocks, U.S. government bonds, gold, cryptocurrencies, electric vehicle giants like Tesla, real estate and many unlikely investments—including GameStop, Blockbuster video and other Reddit chat-room-driven rallies.", "By going the way of the BOJ, the Fed is making odd speculative tangents seem like momentum trades. The BOJ, of course, has long since made the occasional pyramid scheme feel like a winning value investment. That will happen when a central bank effectively nationalizes the stock markets by becoming a top-10 shareholder in almost half the market via exchange-traded funds. ", "The Fed, though, is supersizing the strategy. It’s also increasing the odds it gets trapped. The more monetary authorities commandeer private markets, the more they reward mediocrity among CEOs and boards. The more you overwhelm markets with liquidity, the harder it will be to plot an exit. ", "In 2006, Fukui thought Japan was ready to live without a monetary intravenous—just as Yellen decided in Washington a decade later. In 2021, though, the BOJ and Fed are adding even more ", "life-support tools", " to even bigger IV doses. That’s fueling bubbles anywhere you look as central banks go the Tokyo route."], "clicks": 2489},
{"headline": "GameStop's Executive Shakeup: Here Are The Amazon Veterans Tapped To Lead The Firm's Digital Transformation", "date": "Mar 30, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/5015-606359872d8a430006aecc1b", "paragraphs": ["Struggling brick-and-mortar retailer GameStop has been bulking up its executive ranks since billionaire investor Ryan Cohen joined the firm’s board in January—here are the tech veterans the firm has tapped for the digital transformation that analysts still aren't convinced can happen.", "GameStop is still in search of a permanent chief financial officer after Jim Bell was ousted from the position in February because board members ", "lost faith", " in his ability to help shift the company to an ecommerce focus. Cohen's committee is ", "scouting", " a replacement but hasn't given a specific hiring timeline. ", "GameStop’s unlikely surge has continued with a vengeance (and volatility) since Reddit traders declared it their meme stock of choice in January, as they plowed into Wall Street's most heavily shorted companies. The plight of brick-and-mortar retailers hit GameStop particularly hard over the past decade, wiping out nearly 90% of the stock's gains through the end of 2019 as PC gaming and independent companies like Minecraft gobbled up market share. The firm’s current CEO George Sherman came on board in April 2019, but GameStop's stock began to surge at the tail-end of last year, as 35-year-old Cohen started buying up shares and ", "blasting", " management for \"lack[ing] the mindset, resources and plan needed to [help GameStop] become a dominant sector player.\" Cohen's growing stake helped him and a couple of his Chewy colleagues earn seats on GameStop's board in January, and they've been mounting an effort to usher in a digital transformation for the firm ever since, fueling bullishness among Reddit traders expecting the turnaround.", "GameStop shares have fallen nearly 45% from their late-January high, but they're still up a staggering 5,100% over the past year. Current prices of about $190 are nearly 5 times the stock's average analyst price target of roughly $40.", "\"Given the continuation of very challenged results for GameStop, change is needed and soon,\" Bank of America analyst Curtis Nagle wrote to clients last Wednesday, adding that \"very little detail\" on a transformation plan was given on GameStop's fourth-quarter earnings call and reiterating a price target of $10 per share–about 5% of current prices. \"We continue to be very skeptical on GameStop's efforts to address its long-standing issue of digital disintermediation.\"", "GameStop's Massive Surge Creates A New Billionaire As Reddit Traders Bet Against Wall Street", " (Forbes)", "GameStop CFO Ousted In Shakeup", " ", "(Forbes)"], "clicks": 3755},
{"headline": "GameStop’s Sudden Move Higher Is Another Trap", "date": "Mar 16, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/2464-605054231b7ed00006ed29c0", "paragraphs": [" ", "In less that two weeks, GameStop’s stock spiked from $101.74 on the last trading day in February to close between $260 and $265 on March 10 to 12. It did pull back over $44 on Monday to close at $220.14, still more than double from its end of February price.", "One of the reasons for the move last week was the ", "company announcing", ", “its Board of Directors has formed a Strategic Planning and Capital Allocation Committee to identify initiatives that can further accelerate the Company’s transformation. The Committee is comprised of Alan Attal, Ryan Cohen, and Kurt Wolf, with Mr. Cohen serving as Chairperson.” Cohen is the activist investor who joined the Board in January and is leading the charge to make GameStop more of an e-commerce company. ", "GME is a highly volatile stock", "After a peak close of $347.51 on January 27 and an intra-day high of $483.00 the following day, it only took three days for the stock to close at $90, down 74% and 81%, respectively. And only another two days to close at $53.50, down 85% from the peak close and down 89% from the peak intra-day high.", "Keep in mind that last Wednesday the stock closed up just over $18 to $265 but traded between $172 and $348.50 during the day. It is HIGHLY unusual for a stock to drop over 50% during a single trading session and then recover the loss when there isn’t any fundamental news on the company. If one isn’t prepared for this type of activity, which can lead to large losses, don’t buy it.", "Short squeeze is a minor, if any, player recently", "While the Reddit crowd helped to create a short squeeze on the shares in late January leading the stock to reach $483 intra-day and close at an all-time high of $347.51, the recent increase is probably not due to short positions being covered.", "Ihor Dusaniwsky, Managing Director at Predictive Analytics, estimates how much short interest there is in a stock on a daily basis. His analysis shows that the first big run-up in the shares in late January/early February essentially forced the shorts to cover and dramatically reduce their positions. ", "At the beginning of the year the stock was under $19 (right axis/green line in the chart below) and Dusaniwsky estimates that there were over 70 million shares shorted (left axis/orange line). Since there were 69.7 million shares outstanding as of December 1 last year there was a power keg ready to blow on the stock.", "In late February his analysis shows that there were about 15 million shares shorted before the stock started its recent rise. With 25 million or more shares traded almost every day since February 24, the start of the recent run, it doesn’t appear that short covering has been a major driver.", "The fundamental numbers still don’t make sense", "Before Covid-19 derailed the U.S. and worldwide economies GameStop was slowly losing revenue from fiscal 2017 to 2019 then had a sharp drop-off in fiscal 2020. GameStop may be able to shake up its business enough to recover at least some of downturn but it won’t happen overnight.", "When calculating the company’s valuation metrics these results use fiscal 2019’s $8.3 billion in revenue so as to be as generous as possible."], "clicks": 41147},
{"headline": "Losing Touch With Reality – A GameStop Lesson", "date": "Mar 9, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/50079-6046a7782cc09600064df9a8", "paragraphs": ["Before long, the saga of the GameStop run of 2021 will be studied in economics and investment classes. If you were off grid for the last month, and are not up to date on this story, there are hundreds of articles out there that describe the circumstance of how small retail investors got together on a little known internet forum called “wallstreetbets” and ultimately drove interest and pricing on GameStop’s public stock to unexpected highs. The GameStop stock (Stock Symbol: GME) ended last year near $18 a share but soared as high as $483 in late January 2021. After falling back and trading below $40, the stock then jumped back up in a “Round 2” ramp—along with other popular stocks targeted on Reddit—to $194.50 as of this writing. ", "Many at Wall Street hedge funds were caught in short selling positions, having to cover the differences in prices between the low price they bet on in their “put” options, and the actual price as their options were set to expire. This forced the hand of the hedge funds involved to “cover” their short bets, and purchase the stock at very high prices. One of the hedge funds, Melvin Capital, lost 53% of its value, and had to receive an emergency cash infusion of $2.75 billion. Needless to say, these activities cost these hedge funds billions of dollars as the damage reports and aftermath are still coming in. In a recent article “", "Warnings For Tech Giants And An Ode To A Simpler Web", ",” I called out the ongoing threat of bots and lack of authenticity that is pervasive across platforms such as social networks and forums such as Reddit, Twitter, Facebook, etc. This is an identity and integrity problem that has the potential to cause untold damage in addition to posing an experience issue.", "The GameStop episode has been labeled as a showdown between Wall Street and Main Street. Events played out on the Reddit forum wallstreetbets in a way that corresponded with massive surges of activity, leading many to believe that automated “bots,”  or “pretend users,” helped exacerbate the conditions that ran up the price. The roots of these circumstances within the forum dated back to the middle of 2020, when interest in GameStop investment began to gather momentum. ", "Major investment firms followed the track of publicizing the expectations that the stock would soon be worthless, in a story similar to Blockbuster Video. Typically, this is something they can make true through the presence of investment movement and the open positions that occur when this happens. When the short sales options became due and the price did not match expectations, the hedge funds who expected to win lost big.", "Before long, “Big Tech” intervened with a heavy hand as it has been doing lately, shutting down forums and conversations in places where they popped up. Trading firms, such RobinHood, E*Trade, and others even stopped and curtailed trading in the stock. This saga rose to such prominence, that culminated with hearings in front of Congress.  However, those hearings were a late damage control response attempt that neglects a major issue affecting the majority of experiences on the web nowadays, which is lack of authenticity. Congress, along with “Big Tech,” still missed that point for whatever reason.", "The openness of the social media platforms to malfeasance is a persistent issue. It is difficult to ascertain safety and authenticity when engagements on many platforms are completely anonymous and unauthenticated. Who is a friend? Who is a foe? Or the equally important question—who is a bot and part of a bot farm in an effort to manipulate results? Bot farms exist, and are sponsored not only by criminal enterprises but also by state-actors.", "Bots and bot-based activity are a significant threat to not only the personal privacy and security of the average person, but also the valuation of well-known companies like GameStop, AMC, BlackBerry, etc. The public is engaged in a virtual congregation and exchange of information that could literally be anybody, from anywhere or any automated program. These bots open the door to threats that include:", "As a population, we have a pretty good handle on malicious email activities, but bot activity must be brought into check now  especially in online forums and social media. There seems to be a lack of will by companies like Facebook, Twitter, and Reddit to do so.  With a lack of measures to assure a genuine base of users, trolls and opportunists will leverage any crack possible to jump into the stream and corrupt conversations to their needs. Every account should be validated and traced to an actual individual and in obvious cases, an actual business or organization. What we are seeing is the product of nothing but purposeful neglect and a gap in the mission of what online interactions were built for. ", "It is time to gather around the principles of “who” these platforms are for. Are online forums designed around the experience of having shapeless, anonymous bots consuming online engagements? Can the same be said for social networks? Do you have any idea who is behind the public comments that drop into your Twitter posts? Many people think they do, but the simple fact is that we engage in a virtual world where there is little validation and the experiences we engage in may not be human or genuine in nature. ", "The GameStop situation clearly illustrated that major networks and forums should be regarded as potential risk points. Every one of these risk points should be contextualized in terms of impact and the effort required to ensure a genuine experience and open exchange of ideas. Various technologies can help the effort towards a genuine web. For example, multi-factor authentication, account validation, biometrics, preemptive security monitoring, and other leading technologies provide ways to do this on financial websites. It would only take the will of the social media  giants (with the help of technology) to improve the experiences and impact of these public meeting places in a positive manner. Authentication will bring authenticity to our conversation. Authenticity will bring accountability. Accountability will bring sanity."], "clicks": 10266},
{"headline": "GameStop Should Sell Stock ASAP", "date": "Mar 30, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/2464-60624e410dc4620006a85950", "paragraphs": ["GameStop \n ", " \n  ", "GME", " \n ", " shares have held up extremely well after its earnings announcement a week ago given that the company didn’t take any questions on the conference call and announced in its ", "10-K filing that it may sell shares", ". ", "After falling from $181.75, the close before the announcement, to $120.34 the next day, it immediately rallied the following day to $183.75 erasing all its losses (even after dropping to $116.90). And while it was very volatile on the third day, trading between $163.26 and $218.93, it closed at $181. ", "With the stock up 862% to $181.30 this year from $18.84, the elevated stock price provides management the opportunity to raise a significant amount of cash with very little dilution. It makes perfect sense for the company to sell shares.", "$146.7 million in debt coming due this year", "GameStop had $146.7 million debt coming due this year as of January 30 but paid off essentially half of it, $73.2 million, on March 15 using cash on hand. It had $508 million un-restricted cash on January 30.", "Of the remaining $73.5 million, $48.6 million is owed to its French subsidiary, Micromania SAS, where it pays 0% interest. This debt can be extended until 2025 but the interest rate could increase. The remaining $25 million is revolving credit expiring in November 2022.", "Long-term debt interest rate is 10%", "When a company is not doing well it can wind up paying a much higher interest rate than a healthy company. The bulk of GameStop’s long-term debt consists of $216.4 million, 10% interest rate notes coming due in March 2023, just two years away. By paying this off early, as long as there aren’t any large pre-payment penalties, the company could save $21.6 million in interest costs or almost $0.31 in EPS. Note that GameStop paid $34 million in interest cost last year.", "Selling stock may hardly create much dilution", "GameStop’s shares are up 862% year-to-date with them at $181.30. If the company wanted to raise enough money to pay off the $216.4 million of debt costing it 10% per year and not worry about having to refinance it, the dilution would hardly be noticed. Assuming the company would have to discount the shares to sell them, it would take the following number of shares and the resulting dilution.", "Selling shares could put pressure on the stock. If it were to fall a significant amount the dilution would still not be dramatic.", "If the company wanted to raise $100 million in additional cash this is the number of shares it would have to sell and the dilution.", "Because the valuation numbers don’t make sense", "Before Covid-19 derailed the U.S. and worldwide economies GameStop was slowly losing revenue from fiscal 2016 to 2018 then had a sharp drop-off in fiscal 2019 (ended in January 2020). GameStop may be able to shake up its business enough to recover at least some of downturn but it won’t happen overnight.", "Note that while GameStop’s fiscal year ended on January 30, 2021, and would normally be labeled fiscal 2021, GameStop calls it fiscal 2020.", "When calculating the company’s valuation metrics these results use fiscal 2018’s $8.3 billion in revenue so as to be as generous as possible.", "Due to the huge spike in GameStop’s shares and the resulting bubble valuation metrics, it makes perfect sense for the company to sell shares and put itself on stronger financial footing."], "clicks": 30200},
{"headline": "GameStop Taps Billionaire Investor Ryan Cohen As Board Chair, Sending Shares Surging Anew", "date": "Apr 8, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/5015-606effc11174b20006fdc178", "paragraphs": ["Just three months after joining GameStop's board, Ryan Cohen, the billionaire investor mounting an effort to turnaround and restructure the ailing brick-and-mortar business, has been tapped to head up the company board, once again fueling bullishness among investors who've plowed into the stock at unprecedented levels.", "$1.9 billion. That's how much ", "Cohen", ", who owns roughly 13% of GameStop shares, is worth as of Wednesday's market close, according to ", "Forbes", ".", "GameStop’s unlikely surge has continued with a vengeance (and volatility) since Reddit traders declared it their meme stock of choice in January, as they plowed into Wall Street's most heavily shorted companies. The plight of brick-and-mortar retailers hit GameStop particularly hard over the past decade, wiping out nearly 90% of the stock's gains through the end of 2019 as PC gaming and independent companies like Minecraft gobbled up market share. The firm’s current CEO George Sherman came on board in April 2019, but GameStop's stock began to surge at the tail-end of last year, as 35-year-old Cohen started buying up shares and blasting management for \"lack[ing] the mindset, resources and plan needed to [help GameStop] become a dominant sector player.\" Cohen's growing stake helped him and a couple of his Chewy colleagues earn seats on GameStop's board in January, fueling bullishness among Reddit traders expecting the turnaround.", "GameStop's Executive Shakeup: Here Are The Amazon Veterans Tapped To Lead The Firm's Digital Transformation", " ", "(Forbes)", "After Premarket Drop Traders Still Bullish On GameStop Despite Plan For $1 Billion In New Stock", " ", "(Forbes)", "GameStop, The Second Surge: Anatomy Of A 'Gamma Swarm'", " ", "(Forbes)"], "clicks": 2856},
{"headline": "From GameStop To Karen, How Our Memes Reflect Social Inequality", "date": "Apr 1, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/50246-605b9a780a1579000600d588", "paragraphs": ["On January 5th, in a ", "Forbes ", "prediction ", "piece", " for 2021, I forecasted the fall of Robinhood and the rise of Reddit. ", "Right on.", "However, little did I realize how quickly these foresights would manifest, and secondly, how they’d be so intertwined.", "The GameStop r/WallStreetBets ", "headlines", " took the world by storm due to the unexpectedness and speed of the development. In just days, a group of Redditors challenged coveted hedge funds and the historic stock market. The establishment was less fortified than we thought.", "But the story was in the works for years.", "Beneath our fast-headline veneer of pop culture, a tectonic plate has been shifting. The pandemic, inflaming this shift, has made today’s headlines and sentiment all the more volcanic. But after the last couple years of eruptions, the source is clear.", "Everywhere we look in culture rampant, institutional injustice and inequality is catalyzing action.", "COVID-19 spotlit our exacerbating ", "inequality", ", the driver of every social movement of the last 700 days and the fuel for each one moving forward.", "On both a global and national level, densely populated and poor areas were hit hardest by the pandemic, while low-wage workers were disproportionately affected by subsequent layoffs. It’s also been revealed that nationally, cases and deaths of COVID-19 for Black, Hispanic and Native American populations ", "occurred", " at higher rates. As you could guess, inequality also applies to our ", "vaccine", " rollout.", "Meanwhile, billionaires' wealth rose to ", "$10.2 trillion", " and ", "45", " of the 50 largest U.S. companies turned a profit since March 2020. Further, millions of high income employees continue to work comfortably at home, spending more time with family. Commute times shrunk, while savings ", "soared", ", and Peloton, the luxury home-fitness company, can’t keep up with ", "demand", ".", "When we discuss mixed reality, we conjure VR devices or our media echo chambers constructing competing truths. But mixed reality is most accurate when we consider our truly conflicting livelihoods and outlooks of the world. Our everyday reality is not the same as others’ at the top.", "Reflecting and connecting the dots around this divide, inequality is consistently at the center of our largest stories.", "Many labeled the GameStop buyers as gamblers. After all, Robinhood is just the ", "white-collar brother", " of DraftKings. But for many, holding GameStop was another flavor of activism in 2021.", "Whether due to watching their parents get robbed of the American Dream in the 2008 Great Recession, or getting sold an over-priced higher-education only amounting to un-escapable debt, there’s acute and unresolved financial resentment. This animosity is aimed at neither parents nor professors, but at the ", "system", " which set up this game. The Man.", "James McCombs, a member of r/WallStreetBets shared that he was not motivated by the profits of the GameStop stock, but by the ability to punch ", "up", ", back at the firms which led us to the global financial crisis. \"Now we have an opportunity to take it back,\" ", "says", " McCombs. It’s beyond dollars and cents. It’s about power. Media theorist, Douglas Rushkoff ", "writes", ", “[It’s] simply to make the billionaires pay.”", "We’re mistaken to think that Wall Street is the only target or manifestation of The Man.", "When George Floyd was killed in May, a summer of protests were lit by not the actions of four murderers, but again by a ", "system", ". This time a system of perpetual racism, abuse and brutality. It’s ", "the system ", "which led to those eight minutes and forty-six seconds. To this idea, the shared rallying cry ", "#ACAB", " was not aimed at just those directly involved, but at ", "all", ". A collective. The structure.", "As Victoria Gagliardo-Silver for The Independent ", "put it", ", “Social media is the enemy of American police.”", "But substitute any institution with “police” and the quote still holds up.", "Zoom out, and we see a pattern emerge. Where there’s an injustice of inequality, there’s social media. Equipped with the tools of creation, organization and amplification, when community forms, mountains are moved. The old guard is seemingly powerless against a subreddit, hashtag or even meme.", "Amy Cooper", " of Central Park and Jennifer Schulte AKA ", "Barbecue Becky", " are both Karens, ", "\"", "obnoxious, angry, entitled, and often racist middle-aged white women” — a ", "top 2020 trend", " for Dictionary.com.", "Hurled as a slur by Millennials and Gen Z, “Karen” jabs at the unprogressive and sheltered. More precisely, it’s an acknowledgement of the too frequent abuse of privilege.", "Apryl Williams, a faculty associate at the Berkman Klein Center for Internet & Society, ", "sees", " ideologies from the slave days underlie the practices of Karens.", "“By turning Karen recordings into memes, internet creators are drawing attention to these common acts of aggression that may otherwise be overlooked — and holding the women accountable for their actions.”", "The scorn is not fueled by soccer moms with harsh blond highlights, but rather by the ideologies which they perpetuate.", "Karenism is the rejection of conservatism.", "“Ok Boomer” is just another flavor of Karenism and activism. Again, inequality and social media remain at the center of the movement. It’s a jab at not just archaic ideologies, but ", "senile", " ones. It’s viral generational shaming and blaming fueled by crises.", "Shannon O’Connor, maker of the now iconic “Ok Boomer” hoodie ", "shares", ", “The older generations grew up with a certain mind-set, and we have a different perspective. A lot of them don’t believe in climate change or don’t believe people can get jobs with dyed hair, and a lot of them are stubborn in that view. Teenagers just respond, ‘Ok, boomer.’ It’s like, we’ll prove you wrong, we’re still going to be successful because the world is changing.”", "When COVID-19 was quickly coined “", "The Boomer Remover", "”, the meme became more than a pejorative, but a clear manifestation of the grudge against The Man — those who led us to this point and continue to make the ", "wrong", " decisions.", "“F*ck these people who created this environmental, financial, and oppressive mess. The one which ", "I’ll", " be forced to live in and clean up for the rest of ", "my", " life. What worked for them does not work for me. Okay, Boomer.”", "Celebrity doesn’t grant immunity. They’re just another target.", "When Kim Kardashian hosted a surprise island getaway mid-pandemic, her advertised privilege was rightfully met with envy and fury. #sponsored", "“I surprised my closest inner circle with a trip to a private island where we could pretend things were normal just for a brief moment in time.”", "Kim K’s normal is the 99%’s abnormal. That Kim doesn’t comprehend ", "this", " is just more fuel for the fire. But the truth of the matter is her post didn’t change much. Celebs sealed their fate with their March 18th ", "rendition", " of “Imagine” by John Lennon. We’re certainly not #InThisTogether.", "Weeks later Ellen made matters worse when she ", "cried", " in her mansion, “It’s like being in jail.”", "Radical, QAnon’s fixation upon celebs is just another illustrative point in our global disdain towards the powerful. Winfrey, Gates and Hanks. Notoriety is correlated with conspiracy.", "Celebrity is another out of touch institution, just sparkly.", "Comedian Bill Burr ", "joked", ", “[GameStop] was essentially the #MeToo movement of the stock market.”", "Whether it’s Weinstein or bankers, the people are rising up to hold vile power accountable. Enough.", "It used to be, whatever celebs touch turned to gold. Now, what they touch rusts. The ", "Super Bowl", ", ", "Oscars", " and ", "Grammys’", " ratings have been in free fall for years as the masses question why we’ve been worshipping false idols. Younger demographics are not just tired of award shows and mediums like cable, but specifically the ruthless inauthenticity injected into them.", "For younger demographics, exciting social media driven alternatives look like Patreon, OnlyFans, Substack and YouTube, which now hosts over 30M “channels” uploading ", "500 hours", " of content every minute. When we’re each a creator, there’s then something for each of us. Organic, bottom-up content resonates. We’re the ", "director", ".", "In author Ben Mezrich’s ", "words", ", “Waging war against Big Finance by becoming a day trader is like waging war against the casino industry by becoming a gambling addict. Even if you’re winning, you’re still participating in a broader casino economy — buying drinks, eating dinner, throwing chips to dealers, filling out tables — that, over time, guarantees that the house keeps winning.”", "At the House Financial Services Committee’s five-hour ", "hearing", ", chairwoman, Maxine Waters, (D-CA) amplified this sentiment, “Many Americans feel that the system is stacked against them, and no matter what, Wall Street always wins.”", "When Robinhood, the tool to democratize power, is the one to sell its ", "customer’s data", " and ", "curb", " the movement — no matter its reasoning — we must question who’s ", "really", " working for us. ", "We’re right to doubt who’s on our team. It’s as if the dehumanizing, authoritarian elite are omnipresent.", "In 1971, Townshend of ", "The Who", " warned us of these moments:", "Take a bow for the new revolution, Smile and grin at the change all around", "Then I'll get on my knees and pray, We don't get fooled again", "Meet the new boss, Same as the old boss", "We can listen to ", "The Who", ", or we can author the future we want.", "Think it’s impossible to get a ", "truly", " new boss? Trump.", "In ", "The Revolt of The Public and the Crisis of Authority in the New Millennium", ", Martin Gurri writes:", "“From start to finish, the 2016 presidential race can best be understood as the political assertion of an unhappy and highly mobilized public. In the end, Trump was chosen precisely because of, not despite, his apparent shortcomings. He is the visible effect, not the cause, of the public’s surly and mutinous mood. Trump has been for this public what the objet trouvé was for the modern artist: a found instrument, a club near to hand with which to smash at the established order.”", "We’re getting closer. There’s a trend. We just overshot it with Trump.", "We’re evidently in control of our existing systems, and also in complete control new ones waiting to be built—ones which could ", "absolutely", " work on our behalf.", "We’re more powerful than we give ourselves credit for. And we naturally keep getting the same boss if we permit it.", "Power to the players only becomes ", "true", " when the power is finally taken back. It’s waiting."], "clicks": 483},
{"headline": "GameStop’s $1 Billion Insurance Policy", "date": "Apr 5, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/2464-606b4395581d4e000691fe6d", "paragraphs": ["On December 8 last year GameStop filed a ", "prospectus with the SEC", " describing an “Open Market Sale Agreement” where it could sell up to $100 million of stock “at the market” which is essentially in the flow of normal trading activity. The stock’s close before the filing on December 7 was $16.35.", "With the stock now trading more than 10 times the close on December 7 (it did fall initially this morning to a low of $164.81 but has recovered to around $183) the company ", "updated the filing this morning", " so that it could now sell up to $1 billion in stock but no more than 3.5 million shares. This is a move that makes perfect sense as o", "utlined in my article from early last week", " and the company wrote about in its ", "10-K filing on March 23", ".", "These numbers show why it makes sense", "During December last year GameStop’s stock essentially traded between $13 and $21. It closed the year at $18.84 with a market cap of $1.28 billion. ", "At last Thursday’s close (the market was closed on Friday) the stock was at $191.45 with a market cap of $13 billion, just over 10 times more than the end of last year even though nothing has materially changed in the business.", "The company had $147 million in debt coming due this year and had paid off essentially half of it, $73.2 million, on March 15 using cash on hand. It had $508 million in un-restricted cash on January 30.", "Of the remaining $73.5 million of debt, $48.6 million is owed to its French subsidiary, Micromania SAS, where it pays 0% interest. This debt can be extended until 2025 but the interest rate could increase. The remaining $25 million is revolving credit expiring in November 2022.", "It also has $216.4 million in debt coming due in March 2023, just two years away, that it is paying an interest rate of 10%. If it can pay this off early, as long as there aren’t any large pre-payment penalties, the company could save $21.6 million in interest costs or almost $0.31 in EPS. Note that GameStop paid $34 million in interest cost last year.", "Dilution impact is minimal", "The stock would have to trade just above $285 for the company to raise the maximum $1 billion on 3.5 million shares being sold, which the company views as unlikely. And even if it did the dilution impact would be minimal as GameStop has just over 70 million shares outstanding; 70,031,650 to be exact. ", "If the company wanted to raise enough money to pay off the $216.4 million of debt costing it 10% per year and not worry about having to refinance it, the dilution would hardly be noticed. Even if the shares come under pressure, but stay at $150 or higher, the dilution would be 2.1% or less.", "For each $100 million in additional cash the company wants to raise the dilution could be under 1%.", "What the money will be used for", "Typical boilerplate for the “Use of Proceeds” which is, “We intend to use the net proceeds of this offering, if any, for working capital and general corporate purposes and to further strengthen our balance sheet, which may include funding our transformation initiatives and product category expansion efforts, the repayment, refinancing, redemption or repurchase of our existing indebtedness, and capital expenditures or the satisfaction of our tax withholding obligations upon the vesting of shares of restricted stock held by our executive officers and other employees.”"], "clicks": 1230},
{"headline": "Gamestop, Bond Crash.  Same Thing?", "date": "Mar 10, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/4856-603abfde881a7e000660e2a4", "paragraphs": ["It occurs to me that what Gamestop and the rapid rise in long US Treasury rates (the exact subject of some of my recent articles) have one very critical thing in common: ", "they involve a group of investors, formally or otherwise, crowding into the same trade all at once, thereby pushing \"conventional wisdom\" to the side. ", "In the case of Gamestop, a now-famous group of traders on the Reddit app decided that they could, by sheer numbers and force, push up the price of a stock in a rapid and vicious fashion. Part of this had to do with their belief that such a buying flurry would force “short sellers,” investors who aim to make money when a stock’s price falls instead of rises, buy the stock back to “cover their shorts,” perpetuating the stock’s rise. ", "To steal a line from the show “School of Rock,” what a way to stick it to the man! In this case, the “man” was one or more hedge fund managers who were known to have been short the stock. You can read all about this to your heart’s content elsewhere on Forbes.com. ", "For me, the irony is that at the same time this unique type of crowd-funding effort to break hedge fund managers was happening, there was another story brewing, way over in the bond market. Long-term interest rates were doing their best meme-stock impersonation, and moving up at a historically-rapid rate. ", "The 10-year U.S. Treasury rose from 0.50% in the middle of last year, to a recent peak of about 1.60% in late February. Much of that surge came in just a couple of weeks. ", "This was enough to put the normally sleepy bond market on the front pages of the financial news. I was glad to see this, if for no other reason than what it means at this type of peak euphoria for day-trading and other Dot-Com Bubble era habits that investors adopt.", "After all, trading is for traders, and investing is for investors. There is some crossover, but I lament the fact that in 2021, few market participants can tell the difference. This sows the seeds of eventual regret. As the old expression goes, one definition of a long-term investor is a disappointed speculator.", "It is not surprising to see that the spike in Treasury rates and the manic activity in Gamestop and other stocks come at the same time. This is the era we live in, where any investment can go from calm to hyperactive in days. ", "There is also a “man” that investors may be “sticking it to” when it comes to the lift in Treasury rates. The U.S. Federal Reserve sets very short-term interest rates. Who sets the rates on 10-year, 20-year and 30-year bonds? The bond market! So, perhaps the message in what we see in bonds lately is this: Hey Fed, if you won’t do something to stop suppressing interest rates and return the economy to some normalcy, we, the bond market, will!", "Like Jack Black’s classroom full of kids in the movie version of School of Rock, the atmosphere is increasingly charged up. That should put every investor on notice. ", "This sets up for potentially the best investment climate in recent memory, IF you can do two things that most investors have yet to focus on sufficiently. First, develop a strategy for hedging portfolios. Second, embrace a process for managing a portion of your portfolio tactically. That is, a process whereby you “rent” investments for weeks or months instead of “owning them” for years. ", "It seems to me that the investment world focuses too much attention on both “buy and hold forever” approaches and very short-term (minutes/hours/days) than the types that occupy the middle. Today’s markets operate differently. There are different players, different motivations and social media and technology to disrupt the old rules.", "This calls for enhancing your approach with a mentality that includes succeeding in that middle time frame of weeks to months, and doing all you can to avoid major drawdowns in value along the way. It is in the middle that so much of the profits may be made in the period ahead. And since Gamestop, Treasury Bonds and other market trends are increasingly part of this new wave of investment activity, it behooves us to better understand it.", "In the bond market? Same thing, different investing group! In that case it is the bond market essentially telling the Fed that if the Central Bank continues to do nothing about suppressed interest rates, rising commodity prices, and endless government spending, they will. As I noted in my last article, the Fed controls overnight rates, but the bond market determines the rate of the benchmark 10-year Treasury Bond, and the 30-year Treasury Bond that so many mortgages are tied to.", " ", "The power of the herd is not a Gamestop story. It’s the story of a market that has been pushed to the limit, bubbled up across stocks, bonds, corporate debt, government debt, consumer debt and now, speculative investor excess. ", " ", "For meme stock holders, they risk a quick return to reality. For bond investors and 60/40 allocation fans, it is just the opposite. It might just be the long overdue reversion to the mean for the bond and stock markets. For financial advisors, they either get in sync with that possibility and start learning how to navigate through it, or they will be hearing the phrase \"career risk\" a lot, the same way over-leveraged hedge fund managers do when bubbles pop.", "Comments provided are informational only, not individual investment advice or recommendations. Sungarden provides Advisory Services through Dynamic Wealth Advisors."], "clicks": 1315},
{"headline": "Gary Gensler Confirmed As New SEC Chair As Agency Tackles GameStop Saga, ESG Boom And Cryptocurrency", "date": "Apr 14, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/6438-6074b61dccd4f30006854b1d", "paragraphs": ["Gary Gensler, the recently approved chair of the Securities and Exchange Commission, will have his hands full as he looks to tackle the key issues of the moment including ESG investing, cryptocurrency, order routing and a fiduciary standard for brokers.", "Gensler, who previously served as chair of the Commodity Futures Trading Commission, was approved by the United States Senate on April 14 after a delay . Industry sources say he brings a reputation as an “extremely active regulator” having made it clear in his nomination hearing before the Senate Banking Committee in early March that additional disclosure requirements will be key to his approach to these pressing issues.", "Kirkland & Ellis partner Norm Champ says that increased disclosure around ESG investing should be expected following the recent announcement of a Climate and ESG task force at the SEC led by Acting Deputy Director of Enforcement, Kelly Gibson. Champ expects more onerous requirements for companies to disclose how they are handling climate risk as well as diversity. While ESG investing has exploded over the past decade, there has been scrutiny over a lack of oversight of late as its popularity continues to swell.", "Gensler will bring experience from his career in academia to bear, coming to the SEC from the Massachusetts Institute of Technology Sloan School of Management where he was a professor of the practice of global economics and management. He also served as co-director of a fintech group at the school as well as a senior advisor to the MIT Media Lab Digital Currency Initiative in between his two stints running financial regulators.", "The financial services industry is still looking for a cohesive approach on the categorization of digital assets, which depending on the regulatory body has been considered a commodity, property, currency and a security.", "While issues like ESG and cryptocurrency have been building in prominence and were certain to be top of mind for the next chair, the GameStop stock rally earlier this year fueled by Reddit thrusts issues around online brokerages and order flow onto Gensler’s docket.", "He will also be the latest head of the SEC to tackle the longstanding search for a clear fiduciary standard for financial advisors and broker-dealers that has been kicked back and forth between the SEC and the Department of Labor for a decade. He will likely work on that issue with Martin Walsh, the former Mayor of Boston who was confirmed as President Joe Biden’s pick for Labor Secretary last month. ", "The question remains whether he will strengthen the current law of the land, Regulation Best Interest, through an increased disclosure requirement or take on the larger task of reopening the longstanding debate by taking another look at the definition of fiduciary duty.", "When Gensler ran the Commodity Futures Trading Commission he was active in rulemaking, issuing more than 40 rules and only having one struck down by the courts. Many of the issues he is set to tackle were already on the radar of the SEC under Acting Chair Allison Herren Lee. The exam division featured ESG, climate risks and Reg. BI compliance in its 2021 priorities released earlier this year. Lee said the commission plans to look at order flow payments in a Feb. 25 response to a letter from Senator Elizabeth Warren.", "For now there is not much worry in financial services about the new leadership at the SEC, according to Champ, who spent nearly five years at the SEC serving as director of the Division of Investment Management, deputy director of the Office of Compliance, Inspections and Examinations and the associate regional director for examinations in the regional office located in New York.", "If Gensler surprised the industry by proposing the types of regulations championed by the likes of Senator Warren or others progressive lawmakers, it could cause panic, Champ admits. “People are taking a wait-and-see approach,” he says. ", "That being said, Champ says that he is a contrarian when it comes to the narrative that there will be some seismic shift in SEC presence between the previous and current administrations. ", "“Yes, the Trump administration was deregulatory but from an enforcement and examination perspective, the SEC was incredibly active over the last four years. It is really a disservice to the staff to say otherwise,”  Champ adds. “This narrative that there's going to be some big change in examination and enforcement is way overblown. There will certainly be more rules, but from the policing perspective the SEC has been pretty darn active.”", "However, one area where Champ expects to see a large change from the previous regime is the reemergence of the Financial Stability Oversight Council, created in the aftermath of the financial crisis as part of the Dodd-Frank Wall Street Reform and Consumer Protection Act, in order to identify and monitor excessive risks in the U.S. financial system. Gensler was active in supporting the council in his time at the CFTC and Champ concedes that the group housed within the Department of Treasury has been “dormant” over the past few years.", "His advocacy for a revival of FSOC will be aided by the Consumer Financial Protection Bureau, another agency created by Dodd-Frank that is likely to see a revival under the current administration. President Biden has nominated Rohit Chopra to the post, an acolyte of Senator Warren who helped create the bureau. The head of the CFPB, along with Gensler’s last two federal posts, chairs of the CFTC and SEC, are among the 10 voting members on FSOC.", "During his confirmation process, Gensler has not indicated his preferences to lead the five largest division within the commission, the Division of Enforcement, the Division of Corporation Finance, the Office of Compliance Inspections and Examinations, the  Division of Trading and Markets and the Division of Investment Management. Once he is confirmed, Champ expects names to emerge for those posts and with that more clarity about the tenor of his tenure."], "clicks": 13692},
{"headline": "Why Astronauts on SpaceX Rockets Ride A Tesla To The Launch Pad", "date": "Apr 19, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/7008-60772e0e0f28ef0006b0ef36", "paragraphs": ["SpaceX and NASA have already established a new launch routine for crews leaving Earth on a Crew Dragon spacecraft.", "As long as the next spacecraft is ready as scheduled on Thursday (April 22), the four astronauts aboard Crew-2 will engage in a series of rituals just before launch, including riding a Tesla car to their launch pad at the Kennedy Space Center.", "Each practice is fairly new since Crew Dragon has only sent people to space twice so far, but the astronauts ", "follow the script nonetheless", ". This includes the commander playing a game with the head of the NASA astronaut office until they win, then all crew members looking up at the spacecraft just before entering — and signing their names on the wall outside the spacecraft.", "So why the rituals? Is it only because Elon Musk founded both SpaceX and Tesla and wants to promote both companies every single time he launches something for NASA? Perhaps so, but there is a wider meaning to participating in rituals before the launch event. ", "Participants on Russian spaceflights are famous for having their crew members do ceremonial things such as (", "before a spacesuit redesign in 2019", ") urinating on the tire of their own bus heading to the launch pad; this was an echo of what Soviet cosmonaut Yuri Gagarin did on the first-ever human spaceflight 60 years before. As such, the practices — as odd as they may sound at first — have an important focusing aspect for crews entering a spacecraft.", "Businesspeople and athletes alike are familiar with the ", "need for rituals", ", such as the practice of ", "wearing consistent styles of clothing", " to cut down on daily decision-making — like Facebook founder Mark Zuckerberg’s jeans or former Apple executive Steve Jobs’ turtleneck. Rituals are a way of focusing the body and the mind to prepare for something ahead. In sports, athletes may deliberately lace up their shoes in the same order every time; in yoga, some practices have practitioners do the same movements in the same sequence every single session. By engaging in routine, the argument goes, you can relax yourself and really focus for the key moment ahead, especially in the dangerous environment in space.", "Rituals also can center us in our flight of business or culture in the larger sense. We have in fact been doing rituals as far back as we can track human behavior, although archaeologists and anthropologists also joke that if we can’t explain something we find, we’ll always call it “ritual.” Nevertheless — on the east coast of Britain, for example, Francis Pryor has spent decades examining ", "Bronze Age ritual deposition", " of valuable objects (like axes) in the peat-filled Flag Fen area. He has argued that perhaps these folks ", "wanted to appease the ancestors", "; the rituals also brought the community together for large endeavors.", "Spaceflight, as we have mentioned, is inherently risky. You can thus think of the training itself that astronauts undertake for two years or so as ritual preparation for a myriad of scenarios in space. If something unusual happens, the astronauts have a bit of muscle memory to know how to react effectively and quickly, making quick calls back to the ground for their input. This training in part allowed two crew members to ", "safely emerge from an aborted Soyuz spacecraft", " in 2018 and climb back into the same kind of spacecraft a few months later to successfully fly to space.", "Yet the rituals also create a greater cultural connection among the increasingly international set of astronauts. Wearing a mission patch or signing your name on a door may sound like a small activity, but over a long set of missions it creates a sense of unity with all the people who came before. In 2018, this author was lucky enough to walk twice in the steps of backup Soyuz crews who followed a rocket from its building to the launch pad and saw it erected, shining in the Kazakh sun. Countless people before had engaged in this over many years and countless people will hopefully do this in the future, which left the attendant spectators and media with a sense of awe.", "A whole new set of rituals may come later in the 2020s as crews are ", "scheduled to fly to the moon", " for long-duration missions. After the first people put down their bootprints and establish the base, what environment will they create for the folks coming after them? Will they continue the practices of older space missions or create new ones for their lunar environment? It’s hard to say, but whatever they choose, the crews will be sure to create connections to past and present to honor the long road of space exploration. And if it requires climbing in a Tesla to do so, so be it."], "clicks": 1348},
{"headline": "How To Thrive In The Tesla Era: A Practitioner CIO's Hands-On Recipe (Part 2)", "date": "Apr 19, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/3949-6079a01b453f9c00064cb1e5", "paragraphs": ["CIO & VP at ", "Visteon", ", Transformation Instigator CIO ▶︎ Monetize your IoT, AI, Big Data Science, DevOps | 3X CIO100 | Fortune 500 IT Strategy", "In ", "part one", " of this article, I highlighted that the efficiency, cost, quality and, most importantly, the speed at which software is developed have become the differentiators between companies that are on their way to oblivion and those becoming indomitable market forces.", "Companies not only need to create digitally connected products, but they also need to respond quickly to the growing customer expectations at a much higher velocity. They need to be able to deploy software quickly to the products and production servers that are being used in the field.", "This brings us to DevOps. DevOps is the gateway to improved engineering productivity through initiatives such as easy access to best practices, robust deployment toolchains and the reduction of technical debt through flexible architectures. At my company, we are heavily invested in Dockers and Kubernetes orchestration in order to scale our continuous integration/continuous deployment (CI/CD) capabilities. The use of hyper-converged infrastructures and optimized SDWAN techniques is bringing consistency and resiliency to our DevOps infrastructure.", "When we make prudent decisions about our platforms, software libraries or integrated development environments (IDE), engineering a new product is easier. The trick is to keep prebuilt standard development environment images in your container registry. Software developers no longer need to talk to other team members or rely on tribal knowledge to set up their environment; they can simply spin a prescribed container image spend time on customer feature delivery immediately, rather than focusing on an IT infrastructure issue.", "Once you have a good platform architecture and a DevOps strategy, improving developer productivity is the next key ingredient of an enterprise’s journey to software centricity. Manufacturing and industrial companies are particularly good at managing their plants and equipment with years of industrial engineering knowledge and well-established metrics like OEE (operational equipment effectiveness). By contrast, they do a sub-optimal job of managing the most important software resources — namely, their developers, testers, integrators and architects. There are no established productivity metrics that are a given with the new breed of digital-native competitors. We are still focused on lines of code, the number of commits, etc. Those traditional software productivity metrics are a good starting point but do not really work in a comprehensive manner, especially with the shift toward model-based auto code generations and increased reliance on open-source libraries.", "The need of the hour is to change your mindset from productivity to contribution analytics. Employ modern-day algorithms that can use the power of ML/AI/NLP to determine the sentiment/intent in each code commit comment and the effort behind each software code commit — and appropriately quantify contributions and establish good baselines. A data lake that harvests all important data from multiple source code repositions — as well as task/project management data, including Agile story points, time tracking and defect churn rate — is a great investment. Remember, you cannot fix what you can’t measure, and you can’t monetize what you can’t measure. ", "The other important aspect of developing software competency is making an organization-wide commitment to established frameworks like SPICE (software performance improvement and capability determination). There is a specific version for automotive that is called ", "ASPICE", " (automotive SPICE). These frameworks define processes and best practices for software and software-based system development. The autonomous electric vehicles of the future will have hundreds of millions of lines of software code. A framework like ASPICE can help improve the traceability between customer requirements, design artifacts, software code and test plans. This is especially important for the embedded products in safety-critical domains.", "In conclusion, as products are becoming digital, the advantages that manufacturing companies have always had are fading. These companies must transform into digital enterprises with a software-centric approach to their core design, development and aftermarket strategies. It is still not too late; manufacturing companies that can execute on becoming software-centric can actually have an advantage over newcomers to their markets because of their traditional customer base and domain expertise. ", "This is where the role of the IT leaders who can make the shift from product IT to traditional IT becomes critical. As a leader, you need to figure out how to combine your application development lifecycle management with your product lifecycle management in a holistic way. You need to lead the journey to capture your engineering data in model-based formats and build one common, API-based platform across your product development teams.", "Technology leaders who have an embedded software product development background, who understand the power of the platform and its ecosystems, who have a keen sense of market trends and who have the ability to collaborate and co-create with their product development organization will be the transformers of their enterprises.", "Forbes Technology Council", " is an invitation-only community for world-class CIOs, CTOs and technology executives. ", "Do I qualify?", " "], "clicks": 60},
{"headline": "Saving Investors From Meme Stocks: GameStop (GME)", "date": "Apr 13, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/25-60759bddd6276f0006a4e1e5", "paragraphs": ["“I don’t know what the f— I’m doing, I just know I’m making money,”", "Danny Tran in this ", "TikTok video", ", also featured in The Wall Street Journal’s ", "It’s All Just a Game to Me", ".", "As more investors willfully admit they are gambling on stocks, I feel compelled to offer an easy way to make more informed decisions, and, hopefully, save people lots of money. Over the next few weeks, I’m going to give investors research that shows when meme stocks’ valuations get crazy, and they should sell. This week, I focus on GameStop \n ", " \n  ", "GME", " \n ", " and put it in the Danger Zone.", "Why Investors Need Independent Research", "Wall Street isn’t in the business of warning investors of the dangers in risky stocks because they make too much money from their trading volume and underwriting of debt and equity sales.", "Only independent firms are free to provide unconflicted research and navigate ", "Wall Street conflicts", " and ", "analyst biases", ". With ", "new technology", " to cut through the deluge of data in financial filings and overcome the flaws in Wall Street research, self-directed investors are better positioned than ever to make informed decisions.", "What’s the Problem Here?", "The meme stock frenzy highlights the lack of reliable fundamental research, which creates a vacuum for mis-information that elevates sources like Reddit to undue levels of influence and leads investors to lose perspective.", "Without reliable fundamental research, investors have no way of gauging whether a stock is expensive or cheap. Without a reliable measure of valuation, investors have little choice but to gamble if they want to own stocks. The lack of reliable fundamental research is a big problem if we want the market to have integrity and not unfairly advantage those with better information.", "Figure 1: Mis-Information for Self-Directed Investors Is At an All-Time High", "Meme Stock #1: GameStop: Danger Zone Anywhere Above $45/share", "GME was not worth owning anywhere above $45/share, given the company’s fundamentals, as explained when I closed my Focus List: Long position in the stock in late January. Nevertheless, the stock went on to climb as high as $347/share before taking a roller coaster path back to ~$185/share. See Figure 2.", "Figure 2: Fundamental Research to Know When to Sell GME", "To give readers a sense of just how crazy overvalued the stock was at its peak, I do the math and show how the business would have to perform to justify $347/share.", "“Crazy” at $347 Explained: Implies More Revenue Than Macy’s", " \n ", " \n  ", "M", " \n ", "My ", "reverse discounted cash flow (DCF) model", " is an excellent research tool to analyze the expectations implied by stock prices. To justify $347/share, it shows that GameStop must:", "In this ", "scenario", ", GameStop earns nearly $21 billion in revenue in 2030 or more than the trailing-twelve-months (TTM) revenue of Macy’s (M), ", "AutoZone", " \n ", " \n  ", "AZO", " \n ", ", and Chewy \n ", " \n  ", "CHWY", " \n ", " . See Figure 3 for details.", "Figure 3: GameStop’s Historical Revenue vs. DCF Implied Revenue: Scenario 1", "For reference, GameStop’s revenue fell by 3% compounded annually from 2009 to 2019.", "Still Crazy: At $185", "For perspective on the current price, I run the same analysis to show what the company must do to justify $185/share:", "In this ", "scenario", ", GameStop earns over $11 billion in revenue in 2027, which is 19% higher than GameStop’s record revenue of $9.6 billion in 2012 and the TTM revenue of Nordstrom \n ", " \n  ", "JWN", " \n ", ", Advance Auto Parts \n ", " \n  ", "AAP", " \n ", ", and Chewy. See Figure 4 for details.", "Figure 4: GameStop’s Historical Revenue vs. DCF Implied Revenue: Scenario 2", "More Reliable Fundamental Research on other Meme Stocks", "With a better grasp on fundamentals[1], investors have a better sense of when to buy and sell – and – know how much risk they take when they own a stock at certain levels.", "In the coming weeks, I will perform this same analysis on other meme stocks: AMC Entertainment (AMC), Blackberry (BB), Express Inc. \n ", " \n  ", "EXPR", " \n ", ", Genius Brand \n ", " \n  ", "GNUS", " \n ", "s (GNUS), Koss Corporation (KOSS), Naked Brands Group (NAKD), and Nokia (NOK). Each of these stocks were on Robinhood’s ", "restricted stocks list", " and each saw a major rise and fall in late January.", "I will also feature other meme stocks that trade at levels entirely disconnected from fundamental reality, such as Netflix \n ", " \n  ", "NFLX", " \n ", " and Tesla \n ", " \n  ", "TSLA", " \n ", ".", "Figure 5: Meme Stocks Disconnected From Fundamental Reality", "Disclosure: David Trainer, Kyle Guske II, and Matt Shuler receive no compensation to write about any specific stock, style, or theme.", "[1] Only Core Earnings enable investors to overcome the inaccuracies, omissions and biases in legacy fundamental data and research, as proven in ", "Core Earnings: New Data & Evidence", ", a forthcoming paper in The Journal of Financial Economics written by professors at Harvard Business School (HBS) & MIT Sloan."], "clicks": 5239},
{"headline": "14 Critical Lessons Investors Can Learn From The GameStop Story", "date": "Apr 20, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/4409-607727c93e873000068b0c3d", "paragraphs": ["Investing in the stock market comes with risks, especially in the age of social media. Valuable information that every investor should be aware of—including the occasional volatility of the stock market as well as investment nuances such as short selling—came into the spotlight recently when Redditors banded together to inflate the prices of retailer GameStop’s (GME) stock.", "As well as serving as a refresher on stock market basics, the GameStop situation is also a signpost pointing to emerging trends in investment and fintech. Current and would-be stock market investors can take away some important lessons from this story. Below, 14 members of", " Forbes Finance Council", " share what every investor should learn from the GameStop stock saga.", "1. Micro-communities can have an outsize influence.", "Micro-communities and micro-topics will continue to have outsize market influence that’s driven by natural or synthetic social media magnification. This phenomenon is going to accelerate and be more evident as investors pour into entirely digital asset classes. -", " Ravi Balasubramanian", ",", " Sandbox Banking", "2. Trading is a zero-sum game.", "The GME story brings to mind one of the adages from Peter Lynch: “Avoid hot stocks in hot industries.” While investing based on fundamental changes within a company can make money, trading is a zero-sum game. When a stock becomes hot, speculative and irrational factors will significantly affect the stock price, making it difficult to make a profit. -", " Lijie Zhu", ",", " Dragon Gate Investment Partners", "3. Don’t just follow the herd.", "Herd investing can only get you into trouble. It might work once or twice, but when you eventually get burned, that burn will offset all of your prior gains. Invest in fundamentals and solid intuition, not in fickle social movements. -", " Oliver Sabga", ",", " Term Finance", "4. The stock market can be manipulated.", "The GME story shared an important lesson with us all: At times, the stock market can be manipulated. What Reddit’s “wallstreetbets_” group showed us all was how easily the market can be manipulated. Long-term investors know the market is volatile and invest with caution for obvious long-term growth. New and young investors have taught us what it means to gamble on the stock exchange. -", " Natasha Velez", ",", " H2 IT Solutions, Inc.", "5. Market manipulation can come from multiple places.", "Market manipulation can occur both inside and outside of Wall Street. Influence can come from traditional media, social media and other areas. Be cautious and keep it simple. Invest in what you can understand. -", " Matt Scott", ",", " 7xCapital.com", "6. Regulation needs to be revisited.", "As the Spiderman saga has taught us, “With great power comes great responsibility.” This applies now to retail investors. Sudden moves in the stock market used to be driven by hedge funds, but with the fintech “revolution,” things are different. With the Gamestop/Reddit-Robinhood moment, we all saw that a short-selling squeeze can come from retail investors. A new way to think about regulation is urgently needed. -", " Arcady Lapiro", ",", " Agora", "7. You have to consider time and opportunity costs.", "Financial decisions—especially investments—all have fundamental variables of time and opportunity cost. The GameStop situation is no different. Although the underlying economics did not follow traditional investment logic, the market makers did not factor in the intrinsic value of the retail investors’ time during a pandemic. Speculation is healthy for the economy, but any high-risk investment needs balance. -", " John Tytko", ",", " Caremerge, Inc.", "Forbes Finance Council", " is an invitation-only organization for executives in successful accounting, financial planning and wealth management firms. ", "Do I qualify?", "8. Don’t look at investing as a ‘thrill ride.’", "The stock market is not a casino. Investing one’s hard-earned money should be done in a thoughtful and disciplined way. You can get the thrill of a roller coaster ride by going to a theme park; try to avoid mimicking that thrill by riding the wave of a hot stock. Remember, you are investing to build a nest egg for the long-term future, and losing this can be painful. -", " Sonya Thadhani Mughal", ",", " Bailard, Inc.", "9. Don’t buy or hold stock as a ‘fan.’", "The GameStop/Reddit short-selling story piqued the interest of many non-investors—especially younger generations. Regardless of the public’s interest, ultimately those businesses need to be profitable to maintain such a high degree of demand. That doesn’t appear to be a factor that’s in GameStop’s favor over the last few years. Don’t hold the stock as a fan; keep it as long as it remains a profitable investment. -", " Jeffrey Bartel", ",", " Hamptons Group, LLC", "10. Keep your emotions out of investing.", "Don’t let your emotions rule your investing decisions. Even recently I have seen reports of people taking out loans to buy GameStop at its highest point for the day. As investors, we have to stay prudent with our investments. You never want to be the one who buys high, sells low and repeats until you’re broke. Unless you’re in the front end of such a windfall, be wary of it. -", " Justin Goodbread", ",", " Heritage Investors", "11. Only take bigger risks with money you’re willing to lose.", "If you are planning on shorting stocks and playing the high-risk portions of the market, do so with caution. This should be your “Vegas” money—in other words, the money you are willing to lose. It’s okay to take risks and chase some unicorns; just make sure it’s with money you can afford to lose. -", " Joseph Orseno", ",", " Tiltify", "12. Don’t just react—research.", "“", "Get rich quick” should never be a strategy. Remember the flip side: Potential huge gains are potential huge losses. Do your research. Know your risks and be comfortable with what you could lose. Be knowledgeable, not reactionary. -", " Lori Moes", ", ", "DJM Design CAD & Coordination Services Inc.", "13. Beware the power of groupthink.", "This was less a David-versus-Goliath story than a lesson on the power of groupthink. Though many investors made life-changing amounts of money, many others found themselves without a chair when the music stopped. As boring as it may seem, understanding the fundamentals wins the day, not groupthink—especially when it’s driven by social media. -", " Catherine York Powers", ",", " Constant AI", "14. Use online investment platforms with caution.", "The GameStop upheaval highlighted the shortcomings of investing platforms that encourage excessive trading, such as Robinhood. One important lesson is that these systems are not always designed with the users’ best interests in mind. They encourage frequent trading, yet most successful investing is boring and requires patience. Research shows increased trading activity can negatively affect returns. -", " Marthin De Beer", ",", " BrightPlan"], "clicks": 478},
{"headline": "How Will Tesla Stock Trend Post Q1 2021 Earnings?", "date": "Apr 20, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/25-607e8b5b97a5b000064fb77c", "paragraphs": ["Tesla (NASDAQ: TSLA)", " is expected to publish its Q1 2021 results after the markets close on Monday, April 26. The electric vehicle behemoth has already provided delivery figures for the quarter, noting that it sold 184,800 vehicles over the quarter, a 2.2% sequential increase, and a 109% year-over-year increase. So how are Tesla’s quarterly earnings expected to trend? We expect revenues to come in at about $10 billion, marking an increase of about 67% compared to last year, although this is slightly below the consensus estimates of $10.2 billion. Revenue is likely to decline sequentially, as Tesla paused production of its higher-priced Model S and Model X over Q1 in order to make way for new versions of both luxury vehicles. We expect Tesla’s adjusted EPS to come in at about $0.76 per share - more than 3x last year’s figure, driven by better-fixed cost absorption amid higher deliveries and possibly higher regulatory credit sales. However, our EPS forecasts are marginally below consensus estimates of $0.78.", "Overall, while year-over-year growth is expected to remain strong, we still think Tesla stock is expensive. At its current price of about $740 per share, the stock trades at around 172x estimated 2021 earnings and about 14x 2021 revenues. That being said, Tesla stock still has momentum on its side, and if the company is able to deliver a solid earnings beat, it’s very likely that the stock will rally. See our analysis ", "What To Expect From Tesla’s Q1 2021 Earnings?", " for a detailed overview of revenue and earnings estimates for the company and how it ties to Tesla’s valuation.", "[4/5/2021] Tesla’s Q1 Deliveries", "Tesla", " said that it delivered a total of 184,800 vehicles over Q1 2021.", " [", "1", "]", " This marks an increase of about 2.2% sequentially and about 109% year-over-year. The delivery numbers are strong, considering that the company had to shut down its Fremont facility for two days in February on account of some parts shortages. Moreover, the broader auto industry has had to contend with a shortage of semiconductors and Tesla’s numbers indicate that it likely isn’t being impacted. Model 3 and Model Y deliveries grew by almost 140% year-over-year to 182,780 units, driven by stronger sales in China where the company now also produces the Model Y SUV. However, Model S and X sales stood at just 2,020 units, as Tesla temporarily stopped production of both vehicles. Although the company did not provide specific reasons for this, it is currently ramping up the production of refreshed versions of both vehicles.", "So how will these results impact Tesla’s Q1 2021 results, which are likely due later this month? It’s likely that revenues and margins will trend slightly lower sequentially on account of a lower mix of luxury vehicle sales. See our analysis on ", "How Will Tesla’s Q1 2021 Deliveries Impact Earnings?", " for more details on how Tesla’s deliveries have trended and how they could impact its earnings. That said, Tesla still looks set for a robust 2021, with production scaling up at its Shanghai plant and new factories set to come online in Texas and Berlin. Pent-up demand for new versions of the Model X and S - which are now seeing some of their most substantial updates since they were first launched - is also likely to help. During its most recent earnings call, Tesla said that it expects to grow deliveries at a CAGR of 50% a year over a multi-year horizon.", "[3/26/2021] How VW’s Big EV Push Impacts Tesla ", "Volkswagen", " outlined a series of steps to accelerate its transition to electric vehicles, targeting market leadership by 2025, challenging EV bellwether ", "Tesla", ". VW Group common stock has gained almost 20% since the announcement on March 15, while Tesla stock has declined by about -10% over the same period. So what does VW’s increased EV focus mean for Tesla in the long run? Although we think Tesla will hold its own in the EV market, we think the recent moves by the likes of VW to double down on EVs could eventually make investors rethink Tesla’s lofty valuation.", "VW isn’t exactly new to EVs. The company already has EV offerings across its brands and has invested in multiple partnerships targeted at battery technology, charging, and self-driving software. However, VW hasn’t really scaled up, as its battery-electric vehicle sales stood at just 3% of its 9.3 million total vehicle deliveries last year. That said, the company now wants to make EVs its “core business,” with plans to invest in six large battery factories while doubling down on its own charging infrastructure helping to lock in supply and increase control of its technology, much like Tesla. VW has the scale to compete - it sold over 9 million cars last year compared to just about half a million for Tesla and it also has a host of premium brands including Porsche and Audi that are likely to help its EV push. Also Europe, VW’s home market, is now the largest market for EVs, with the government offering generous incentives and this could also help VW scale up sales.", "Now, we think that Tesla will also hold its own even as the competition increases, given its early mover advantage in the self-driving and software space and its strong brand image that’s associated with high-tech EVs. Tesla is currently valued at $600 billion-plus (roughly four times VW) implying that investors expect the company will essentially dominate the EV market in the years to come. Tesla’s outlook is also extremely aggressive, with the company indicating that it expects to grow deliveries at a lofty CAGR of 50% a year over a multi-year horizon. However, we think investors could re-rate Tesla’s valuation lower if VW (or other mainstream automakers) manage to deliver compelling EVs that are well-received by customers, following through on its EV growth targets. For perspective, VW trades at a little over 35x projected 2021 earnings currently, compared to Tesla which trades at over 150x and this gap could narrow if VW executes well.", "Tesla stock has declined by almost -10% over the last two weeks (10 trading days). What are the odds of the stock rising over the next month? You can test the answer and many other combinations on the ", "Trefis Machine Learning Engine to test Tesla stock chances of a rise", " after a fall. You can test the chance of recovery over different time intervals of a quarter, month, or even just one day!", "[1/26/2021] Tesla Q4 Earnings Preview", "Tesla", " is expected to publish Q4 2020 results on Wednesday, January 27. The company has already provided delivery figures for the quarter, selling a record 180,570 cars, up 29% sequentially and by over 60% year-over-year. So how will the strong vehicle sales impact quarterly earnings? We expect the company to report revenues of about $10.2 billion, roughly in line with the consensus estimates, and a jump of about 38% year-over-year. We expect Tesla’s adjusted EPS to come in at about $0.99 per share - more than double last year’s figure, driven by better-fixed cost absorption amid higher deliveries and stronger sales of regulatory credits, which we estimate are almost pure profit. However, our EPS forecasts are slightly below consensus.", "Overall, while growth is likely to remain strong, with Tesla certainly on firmer ground financially, we continue to believe that the stock is meaningfully overvalued, trading at around 360x estimated 2020 earnings and about 26x Revenues. That being said, Tesla stock has momentum on its side, and if the company is able to deliver an earnings beat, it’s likely that its stock could rally further. See our analysis ", "What To Expect From Tesla’s Q4 2020 Earnings?", " for a detailed overview of Tesla’s Revenues and its performance in recent quarters.", "[1/12/2021] Is Tesla Poised For Further Gains", "Tesla", " stock has rallied by over 11% over the last 5 trading days and by a solid 23% over the last 10 trading days, driven by strong Q4 vehicle deliveries, which helped the company largely meet its target of selling 500k cars for 2020, and also due to a change in stance by a notable long-time Tesla bear. In comparison, the broader S&P 500 returned less than 3% over the last 5 trading days. Now, is Tesla stock poised to rise further? Although we believe the company remains fundamentally overvalued, trading at about 200x consensus 2021 earnings, Tesla has momentum on its side, and there could be more room for gains in the stock. Specifically, there is a 69% chance of a rise in Tesla stock over the next month (21 trading days) based on our machine learning analysis of trends in the stock price over the last 5 years. See our analysis on ", "Tesla Stock Chances of Rise ", "for more details. Curious about the possibility of rising over the next quarter? Check out the ", "Tesla Stock AI Dashboard: Chances Of Rise And Fall", " for a variety of scenarios on how Tesla stock could move.", "[1/8/2021] Tesla Too Dependent On Elon Musk?", "Tesla", " stock has soared about 8x over the last year, with its market cap approaching $800 billion. Tesla is valued unlike any other automotive stock - at about 200x consensus 2021 earnings, vs about 20x for the broader auto industry.", " [", "2", "]", " The Tesla investment thesis hinges on a lot more than selling luxury EVs. Investors are counting on Tesla to make fully self-driving cars, launch a fleet of robo taxis, make big improvements to battery tech, and more broadly drive the decarbonization of the auto industry. This story is tied in no small measure to the business acumen and leadership of Tesla’s visionary CEO, Elon Musk. Mr. Musk has already delivered big - changing the perception around EVs with highly desirable vehicles, building factories in record time, and taking big strides in autonomous driving. (", "Just How Far Ahead Is Tesla In The Self-Driving Race?", ") But Tesla still has a lot to prove and it will probably be years before the company grows into its lofty valuation. If Mr. Musk, left the scene, for any reason, there’s no question that the story surrounding Tesla stock would change dramatically.", "The closest parallel to Tesla’s dependence on Mr. Musk would be ", "Apple", " and the late Steve Jobs. However, Apple was much larger and more mature when its visionary departed in 2011. Apple’s Revenues stood at about $110 billion in FY’11 and its business model was largely set in stone. Its computing trifecta of the iPhone, iPad, and Mac were well established in their respective categories and the services business, led by the AppStore, was building momentum. Tesla, on the other hand, is still early in the growth cycle and is barely profitable, excluding its regulatory credit sales. (related:", " How Regulatory Credits Impact Tesla’s Margins", ")", "While the fortunes of most other mega-cap companies are also tied to their founders or senior leadership to some measure, there is a fair amount of margin of safety. For example, Facebook (with a market cap of $760 billion) and Google ($1.2 trillion) have their platforms and network effects that power their ad machines. Apple ($2.2 trillion) investors value its ecosystem that locks customers in and gets them to keep spending on products and services, while Amazon ($1.6 trillion) investors are buying into a massive physical and cloud-based infrastructure that powers its e-commerce juggernaut. We think Tesla investors, on the other hand, are really paying a premium for the ongoing innovation and future potential which is heavily tied to Mr. Musk. While this risk is obviously hard to quantify, it’s worth noting for shareholders.", "Want to play the Electric Vehicle market, but think that stocks of EV brands are overvalued? Component suppliers might be a better bet. Check out our theme on ", "Electric Vehicle Component Supplier Stocks", " for more details.", "[12/21/2020]", "Tesla", " will be added to the S&P 500 index on Monday, December 21. The stock has rallied by about 70% since the announcement of the index inclusion in mid-November and is up a whopping 8x this year, with its current market cap standing at about $660 billion. The Tesla story has appeal - the company is at the forefront of two of the biggest trends in the automotive market - electric vehicles and self-driving software. Tesla has also grown despite the pandemic, driven in part by its Chinese business, and has also posted profits over the last five quarters (although a bulk of the profits still come via the sale of regulatory credits).", "However, we think the stock is significantly overvalued at current levels. Tesla trades at about 15x projected 2021 Revenue and about 175x projected earnings. There’s little precedent for this sort of valuation in the highly cyclical and capital-intensive auto industry in recent history. In fact, using the industry average P/E of about 15x", " [", "3", "]", ", Tesla would have to post over 2x the profits of the top ten automakers combined to justify its valuation. For perspective, the top ten automakers by sales posted net profits of under $20 billion over the last 12 months.", "Now with the S&P inclusion likely to bolster Tesla’s position as a blue-chip name, could it still see a correction in the near to medium term? While Tesla stock might see lower volatility post its entry into the index, considering that its shareholder base will skew towards passive investors who won’t be actively trading and potentially managed funds that are benchmarked to the S&P 500, the stock could still get a reality check for a couple of reasons. Firstly, with highly effective vaccines being rolled out things should start getting back to normal, helping the economy. Now even an indication that the U.S. Fed could revisit its stance on ultra-low interest rates could hit valuations for high-growth stocks like Tesla. There are industry-specific risks as well. Mainstream players such as GM and Volkswagen have been doubling down on EV investments. If these players deliver compelling EVs that are well-received with customers, it could change the narrative around the auto majors and potentially hurt the valuation of pure-play EV companies such as Tesla. (related: ", "How Do We Make Sense Of EV Stock Valuations?", ")", "Want to play the Electric Vehicle market, but think that stocks of EV brands are overvalued? Component suppliers might be a better bet. Check out our theme on ", "Electric Vehicle Component Supplier Stocks", " for more details.", "[11/18/2020] Tesla Will Join S&P 500, What Does This Mean For The Stock?", "On Monday, S&P Dow Jones indicated that electric vehicle bellwether ", "Tesla", " would be included in the S&P 500 index, causing the stock to rally by over 8% in Tuesday’s trading. The inclusion is likely to be effective from December 21, although it could occur in two tranches given that Tesla will be the largest company ever added to the index, and among the top 10 companies by market cap on the S&P 500. So what does this mean for Tesla stock and investors?", "Firstly, the inclusion could drive strong near-term demand for Tesla stock from not just index funds that track the S&P 500 but possibly from managed funds that are benchmarked to the S&P 500. For perspective, S&P Dow Jones estimates, based on recent market cap data, that funds will need to sell other positions to the tune of around $51 billion to buy Tesla stock.", " [", "4", "]", " Based on Tesla’s current market cap, this likely translates into roughly 11.5% of Tesla’s total shares outstanding and over 13% of Tesla’s free float (publicly held shares that can be traded without restrictions). Secondly, having a large chunk of Tesla stock held by passive index investors could eventually reduce volatility for Tesla, which has been prone to big swings in the past. That said, the index inclusion doesn’t change the fundamental picture for Tesla. The stock appears pricey in our view, trading at about 110x consensus 2021 earnings, compared to about 26x for the broader S&P 500. At these valuations, Tesla will need to execute very well - banking on new launches such as the Model Y, its international expansion, and higher software sales - to justify its stock price.", "[Updated 7/15/2020] Will Tesla Be On S&P 500? Tesla’s Software Has One Clue", " ", "As a leader in autonomous driving, we estimate that ", "Tesla", " recorded $1.4 billion in Software Revenue in 2019 via sales of its Full Self Driving software upgrades. These upgrades, which cost about $8,000 per vehicle currently, are also highly lucrative. So ", "How Do Tesla’s Software Upgrades Impact Its Margins?", " ", "We estimate that they contributed about 400 basis points (4%) to Tesla’s Automotive Gross Margins (revenues less direct costs, divided by revenues) of 21% in 2019. Excluding software sales, Tesla is unlikely to have been profitable over the last few quarters. No discussion about S&P inclusion.", "How Do Software Sales Impact Tesla’s Margins?", "Why Software Could Account For A Higher Mix of Margins Going Forward", "Electric vehicles are the future of transportation, but picking the right EV stocks can be tricky. Investing in ", "Electric Vehicle Component Supplier Stocks", " can be a good alternative to play the growth in the EV market.", "See all ", "Trefis Price Estimates", " and ", "Download ", "Trefis Data", " here", "What’s behind Trefis? See How It’s Powering New Collaboration and What-Ifs For ", "CFOs and Finance Teams", " | ", "Product, R&D, and Marketing Teams"], "clicks": 545},
{"headline": "GameStop Reportedly Looking For A New CEO", "date": "Apr 12, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/7172-6074ba0bccd4f3000686ff28", "paragraphs": [], "clicks": 2491},
{"headline": "Two Killed In Tesla Crash With No Driver At The Wheel", "date": "Apr 18, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/5015-607c827c9d9fd3000693fb01", "paragraphs": ["Two men riding inside a driverless Tesla Model S sedan died Saturday night after the vehicle crashed into a tree and immediately caught on fire, according to multiple reports, raising questions about the electric-carmaker's vehicle safety as the company faces a slew of related federal investigations.", "Over the past couple of years, Tesla has faced growing scrutiny from federal regulators over safety concerns spurred by self-driving car crashes. Last month, the National Highway Traffic Safety Administration, which oversees auto safety in the U.S., ", "revealed", " it's opened nearly 30 investigations into Tesla car crashes, including nearly two dozen that at the time remained open. The NHTSA says it's investigated crashes \"involving Tesla vehicles where it was believed some form of advanced driver assistance system was engaged at the time of the incident.” According to Reuters, the agency's Special Crash team ", "investigates", " more than 100 crashes a year involving emerging technologies, with recent issues arising from vehicles' adaptive controls, safety belts and child restraint systems, among other things. ", " ", "In December 2019 and January 2020, there were at least three separate ", "crashes", " that killed three people and all involved the vehicles' autopilot driving technology. Tesla has urged drivers to remain cautious while using the autopilot feature and ", "states", " on its website that \"the currently enabled features require active driver supervision and do not make the vehicle autonomous.\"", "\"Tesla with Autopilot engaged now approaching 10 times lower chance of accident than average vehicle,\" Elon Musk ", "tweeted", " Saturday evening, just hours before the crash.", "‘No one was driving the car’: 2 men dead after fiery Tesla crash in Spring, officials say", " ", "(KPRC 2)", "Fatal Tesla Crash in Texas Believed to Be Driverless", " ", "(WSJ)", " ", "U.S. safety agency reviewing 23 Tesla crashes, three from recent weeks", " ", "(Reuters)"], "clicks": 14050}
]